Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/django-partial.po
Languages: ar

source: The number of times the student can try to answer this problem.
ar: عدد المرات التي يمكن للطالب فيها محاولة الإجابة على هذه المسألة.

source: Allow File Uploads
ar: السماح بتحميل ملف

source: Whether or not the student can submit files as a response.
ar: هل يستطيع الطالب أن يقوم بتقديم ملفات كإجابة أم لا.

source: Disable Quality Filter
ar: إيقاف التصفية على أساس الجودة

source: If False, the Quality Filter is enabled and submissions with poor spelling, short length, or poor grammar will not be peer reviewed.
ar: في حال اختيار النفي، يتمّ تفعيل خاصية التصفية على أساس الجودة، وعندها لن يتم إجراء تقييم النظراء بالنسبة للأوراق المقدّمة التي تتضمّن أخطاء إملائية أو نحوية أو التي تكون أقصر مما يجب.

source: Current version number
ar: رقم الإصدار الحالي

source: Defines the number of points each problem is worth. If the value is not set, each problem is worth one point.
ar: تحديد عدد النقاط التي تستحقّها كلّ مسألة. إذا لم يتمّ ضبط القيمة، فإن كل مسألة ستستحق نقطة واحدة.

source: Minimum Peer Grading Calibrations
ar: الحد الأدنى لمعايير التقييم من قبل النظراء

source: The minimum number of calibration essays each student will need to complete for peer grading.
ar: الحد الأدنى لعدد مقالات المعايرة التي يجب على كل طالب استكمالها لغرض التقييم من قبل النظراء.

source: Maximum Peer Grading Calibrations
ar: الحد الأقصى لمعايير التقييم من قبل النظراء

source: The maximum number of calibration essays each student will need to complete for peer grading.
ar: الحد الأقصى لعدد مقالات المعايرة التي يجب على كل طالب استكمالها لغرض التقييم من قبل النظراء.

source: Peer Graders per Response
ar: عدد المقيِّمين النظراء لكل ردّ

source: The number of peers who will grade each submission.
ar: عدد النظراء الذين سيقيمون كل ورقة مقدّمة.

source: Required Peer Grading
ar: تقييم النظراء المطلوب

source: The number of other students each student making a submission will have to grade.
ar: عدد الطلاب الآخرين الذين يتعين أن يقيّمهم كل طالب يقوم بتقديم ورقة .

source: Allow "overgrading" of peer submissions
ar: السماح بـ"التقييم المبالغ به" للأوراق المقدّمة من قبل النظراء.

source: EXPERIMENTAL FEATURE. Allow students to peer grade submissions that already have the requisite number of graders, but ONLY WHEN all submissions they are eligible to grade already have enough graders. This is intended for use when settings for `Required Peer Grading` > `Peer Graders per Response`
ar: الميزة التجريبية. السماح للطلاب بإجراء تقييم النظراء للأوراق المقدّمة التي تتمتّع بالفعل بعدد المقيّمين المطلوب، مع التأكيد أن يكون ذلك فقط في حال كانت كل الأوراق المقدّمة المؤهلة للتقييم تتمتّع بالفعل بالعدد الكاف من المقيّمين. ويستخدم ذلك عندما تكون إعدادات `Required Peer Grading` > `Peer Graders per Response`

source: Getting Started With Studio
ar: البدء باستخدام استوديو edX

source: Add Course Team Members
ar: إضافة أعضاء لفريق المساق

source: Grant your collaborators permission to edit your course so you can work together.
ar: منح المتعاونين معك الصلاحية لتعديل مساقك بحيث يمكنكم العمل سوياً.

source: Edit Course Team
ar: تعديل فريق المساق

source: Set Important Dates for Your Course
ar: تحديد تواريخ مهمّة لمساقك

source: Establish your course's student enrollment and launch dates on the Schedule and Details page.
ar: تحديد تاريخ التحاق الطلاب وتاريخ البدء لمساقك ونشر ذلك على صفحة التفاصيل والجدول.

source: Edit Course Details &amp; Schedule
ar: تعديل تفاصيل المساق والجدول الخاص به

source: Draft Your Course's Grading Policy
ar: صياغة سياسة التقييم ووضع الدرجات الخاصة بمساقك

source: Set up your assignment types and grading policy even if you haven't created all your assignments.
ar: إعداد أنواع المهمّات وسياسة التقييم الخاصة بمساقك حتّى وإن كنت لم تقم بإنشاء كلّ المهمّات بعد.

source: Edit Grading Settings
ar: تعديل إعدادات التقييم

source: Explore the Other Studio Checklists
ar: الاطلاع على قوائم المراجعة الأخرى الخاصّة بالاستوديو

source: Discover other available course authoring tools, and find help when you need it.
ar: اكتشاف الأدوات الأخرى المتاحة لتأليف المساق، والحصول على المساعدة عند الحاجة إليها.

source: Draft a Rough Course Outline
ar: صياغة مسودّة للمخطّط الكلّي للمساق

source: Create Your First Section and Subsection
ar: إنشاء القسم والقسم الفرعي الأوّل لمساقك

source: Use your course outline to build your first Section and Subsection.
ar: استخدام المخطّط الكلّي لمساقك لإنشاء القسم والقسم الفرعي الأولّ.

source: Edit Course Outline
ar: تعديل المخطّط الكلّي للمساق

source: Set Section Release Dates
ar: تحديد تواريخ نشر القسم

source: Specify the release dates for each Section in your course. Sections become visible to students on their release dates.
ar: تحديد تواريخ النشر الخاصة بكل قسم في مساقك. تصبح الأقسام مرئية للطلاب عند حلول تواريخ النشر المقرّرة لها.

source: Designate a Subsection as Graded
ar: تعيين قسم فرعي على أنّه تم تقييمه

source: Set a Subsection to be graded as a specific assignment type. Assignments within graded Subsections count toward a student's final grade.
ar: تحديد قسم فرعي ليتمّ تقييمه بمثابة نوع مهمّة محدّد. تُحتسب المهمّات التي تندرج تحت الأقسام الفرعية التي تم تقييمها ضمن الدرجة النهائية للطالب.

source: Reordering Course Content
ar: إعادة ترتيب محتوى المساق

source: Use drag and drop to reorder the content in your course.
ar: استخدام أسلوب السحب والإسقاط لإعادة ترتيب المحتوى في مساقك.

source: Renaming Sections
ar: إعادة تسمية الأقسام

source: Rename Sections by clicking the Section name from the Course Outline.
ar: إعادة تسمية الأقسام من خلال النقر على إسم القسم من المخطّط الكلّي للمساق.

source: Deleting Course Content
ar: حذف محتوى المساق

source: Delete Sections, Subsections, or Units you don't need anymore. Be careful, as there is no Undo function.
ar: حذف الأقسام، أو الأقسام الفرعية، أو الوحدات التي لم تعد بحاجة إليها. الرجاء توخّي الحذر، إذ إنّ وظيفة إلغاء العملية غير متوفّرة.

source: Add an Instructor-Only Section to Your Outline
ar: إضافة قسم خاص بالموجّه فقط إلى المخطّط الكلّي لمساقك

source: Some course authors find using a section for unsorted, in-progress work useful. To do this, create a section and set the release date to the distant future.
ar: يجد بعض مؤلّفي المساقات أنه من المفيد تخصيص واستخدام قسمٍ للمواد غير المرتّبة وقيد الإعداد. للقيام بذلك، يمكنك إنشاء قسم جديد على أن يكون تاريخ نشره في المستقبل البعيد.

source: Explore edX's Support Tools
ar: الاطلاع على أدوات الدعم الخاصة بـ edX

source: Explore the Studio Help Forum
ar: الاطلاع على منتدى المساعدة الخاص ببرنامج استوديو

source: Access the Studio Help forum from the menu that appears when you click your user name in the top right corner of Studio.
ar: يمكن الدخول إلى منتدى المساعدة الخاص ببرنامج استوديو من القائمة التي تظهر عند النقر على إسم المستخدم الخاص بك في أعلى الزاوية اليمنى من شاشة برنامج استوديو.

source: Visit Studio Help
ar: زيارة صفحات المساعدة الخاصة ببرنامج استوديو

source: Enroll in edX 101
ar: التسجيل في edX 101

source: Register for edX 101, edX's primer for course creation.
ar: التسجيل في edX 101، الدليل التمهيدي الخاص بـedX لإنشاء المساق.

source: Register for edX 101
ar: التسجيل في edX 101

source: Download the Studio Documentation
ar: تنزيل وثائق الاستوديو

source: Download the searchable Studio reference documentation in PDF form.
ar: تنزيل الوثائق المرجعية القابلة للبحث والخاصة ببرنامج استوديو بصيغة PDF.

source: Download Documentation
ar: تنزيل الوثائق

source: Draft Your Course About Page
ar: صياغة صفحة "لمحة عن المساق" الخاصة بمساقك

source: Draft a Course Description
ar: صياغة صفحة وصف المساق

source: Courses on edX have an About page that includes a course video, description, and more. Draft the text students will read before deciding to enroll in your course.
ar: تحتوي المساقات الموجودة على منصة edX على صفحة "لمحة عن المساق" تتضمّن مقطع فيديو، ووصف خاص بالمساق وغير ذلك. الرجاء صياغة النصوص التي سيقرؤها الطلاب قبل اتخاذ القرار بالتسجيل في مساقك.

source: Edit Course Schedule &amp; Details
ar: تعديل تفاصيل المساق والجدول المرتبط به

source: Add Staff Bios
ar: إضافة السير الذاتية لطاقم المساق

source: Showing prospective students who their instructor will be is helpful. Include staff bios on the course About page.
ar: يعتبر تعريف التلاميذ بموجّه المساق الذي يحتمل أن يقوموا بالتسجيل فيه أمراً مفيداً. الرجاء إدراج السير الذاتية لطاقم المساق في صفحة "لمحة عن المساق".

source: Add Course FAQs
ar: إضافة الأسئلة المتكررة الخاصة بالمساق

source: Include a short list of frequently asked questions about your course.
ar: إدراج قائمة قصيرة من الأسئلة المتكررة الخاصة بمساقك.

source: Add Course Prerequisites
ar: إضافة متطلّبات المساق

source: Let students know what knowledge and/or skills they should have before they enroll in your course.
ar: تعريف الطلاب بالمعارف و/أو المهارات التي يجب أن يتمتّعوا بها قبل أن يلتحقوا في المساق.

source: General
ar: عام

source: TBD
ar: سيتم تحديده لاحقاً

source: Category
ar: الفئة

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: إسم الفئة الخاص بالنقاش. يظهر هذا الإسم في الجزء الجانبي الأيمن من منتدى النقاشات الخاصة بالمساق.

source: Subcategory
ar: الفئة الفرعية

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
ar: إسم فئة فرعية لهذا النقاش. يظهر هذا الإسم في الجزء الجانبي الأيمن من منتدى النقاشات الخاصة بالمساق.

source: Text
ar: النص

source: Html contents to display for this module
ar: محتوى HTML الذي سيتم عرضه لهذه الوحدة.

source: Source code for LaTeX documents. This feature is not well-supported.
ar: التعليمات البرمجية الأصلية لوثائق LaTeX . هذه الميزة غير مدعومة بشكل جيد.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
ar: اختيار "مرئي" يُمكِّن من إدخال المحتوى بحيث يقوم برنامج المحرّر بالإنشاء التلقائي للغة HTML المقابلة. كما يمكن اختيار "أولي" من أجل تعديل تعليمات HTML بشكلٍ مباشر. في حال تغيير هذا الإعداد، يجب حفظ العنصر ثمّ إعادة فتحه لإجراء التعديل.

source: Editor
ar: محرر

source: Visual
ar: مرئي

source: Raw
ar: أولي

source: HTML for the additional pages
ar: تعليمات HTML للصفحات الإضافية

source: List of course update items
ar: قائمة بعناصر تحديث المساق

source: Image Annotation
ar: إضافات توضيحية بشكل صورة

source: Tags for Assignments
ar: بطاقات التعريف الخاصة بالمهام

source: Add tags that automatically highlight in a certain color using the comma-separated form, i.e. imagery:red,parallelism:blue
ar: إضافة بطاقات تعريف التي تبرز تلقائياَ بلون محدّد باستخدام النموذج المفصول بفواصل، أي الصور:أحمر،التوازي:أزرق

source: Location of Annotation backend
ar: موقع الواجهة الخلفية الخاصة بالحواشي

source: Url for Annotation Storage
ar: الرابط الإلكتروني لتخزين الحواشي

source: Secret string for annotation storage
ar: الأحرف التسلسلية السرية لتخزين الحواشي

source: Secret Token String for Annotation
ar: تسلسل الحروف الرمزي السري للحواشي

source: Enter the name that students see for this component. Analytics reports may also use the display name to identify this component.
ar: الرجاء إدخال الإسم الذي سيراه الطلاب لهذا العنصر. وقد تستخدم تقارير التحليلات كذلك نفس الإسم لتمييز هذا العنصر.

source: LTI ID
ar: الرمز التعريفي لـ LTI

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See
ar: إدخال الرمز التعريفي لـLTI لمزوّد LTI الخارجي. يجب أن تطابق هذه القيمة الرمزَ التعريفي لـ LTI الذي أدخلته في إعدادات جوازات مرور LTI في صفحة الإعدادات المتقدّمة.الرجاء الاطلاع على<br />

source: LTI URL
ar: الرابط الإلكتروني لـ LTI

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See
ar: الرجاء إدخال الرابط الإلكتروني للأدوات الخارجية التي يشغّلها هذا العنصر. يستخدم هذا الإعداد فقط عندما تكون خاصية "إخفاء الأداة الخارجية" مضبوطة على "خاطئ". الرجاء الاطلاع على<br />

source: Custom Parameters
ar: المعطيات المخصّصة

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.<br />See
ar: إضافة زوج بيانات المفتاح/القيمة لأي معطيات مخصّصة، مثل الصفحة التي يجب أن يفتح بها كتابك الإلكتروني أو لون الخلفية لهذا العنصر. الرجاء الاطلاع على<br />

source: Open in New Page
ar: يفتح في صفحة جديدة

source: Select True if you want students to click a link that opens the LTI tool in a new window. Select False if you want the LTI content to open in an IFrame in the current page. This setting is only used when Hide External Tool is set to False.
ar: الرجاء اختيار "صحيح" إذا أردت أن يضغط الطلاب على رابط يفتح أداة LTI في نافذة جديدة، واختيار "خاطئ" في حال أردت أن يُفتح محتوى LTI في IFrame في الصفحة الحاليّة نفسها. يستخدم هذا الإعداد فقط في حال كان خيار "إخفاء الأداة الخارجية" مضبوطاً على "خاطئ".

source: Scored
ar: تمّ التقييم

source: Select True if this component will receive a numerical score from the external LTI system.
ar: اختيار إعداد "صحيح" في حال كان هذا العنصر سيحصل على درجة رقمية من نظام LTI الخارجي.

source: Weight
ar: الوزن

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
ar: الرجاء إدخال عدد النقاط الممكنة لهذا العنصر. القيمة الأوليّة المحددة هي 1.0. يتمّ استخدام هذه القيمة فقط في حال كان إعداد خاصية "التقييم" مضبوطاً على "صحيح".

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
ar: النتيجة المحفوظة في xblock KVS - مطابقة للنتيجة المنشورة في قاعدة بيانات django

source: Comment as returned from grader, LTI2.0 spec
ar: التعليق بحسب ما رجع عن المسؤول عن التقييم، LTI2.0 spec

source: Hide External Tool
ar: إخفاء الأداة الخارجية

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
ar: الرجاء اختيار "صحيح" إذا أردت استخدام هذا العنصر بمثابة حجز خانات لغرض المزامنة مع نظام تقييم خارجي بدلاً من تشغيل أداة خارجية. يؤدي هذا الإعداد إلى إخفاء زر التشغيل وأي IFrames لهذا العنصر.

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
ar: لا يمكن تحليل المعطيات المعدّلة: {custom_parameter}. يجب أن يكون تسلسل النص على شكل "x=y".

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
ar: لا يمكن تحليل جواز مرور LTI: {lti_passport}. يجب أن يكون التسلسل النصي على شكل "id:key:secret".

source: Show Single Problem
ar: عرض مسألة واحدة

source: When True, only the single problem specified by "Link to Problem Location" is shown. When False, a panel is displayed with all problems available for peer grading.
ar: عندما يكون مضبوطاً على "صحيح"، يتمّ فقط إظهار المسألة الواحدة المحدّدة من خلال "الرابط إلى موقع المسألة". أما في حالة الضبط على "خاطئ"، يتم عرض لوحة جانبية تتضمّن كافة المسائل المتاحة لتقييم النظراء.

source: Link to Problem Location
ar: الرابط إلى موقع المسألة

source: The location of the problem being graded. Only used when "Show Single Problem" is True.
ar: موقع المسألة التي يجري تقييمها. يستخدم فقط عندما يكون إعداد "عرض مسألة واحدة" مضبوطاً على "صحيح".

source: Defines whether the student gets credit for grading this problem. Only used when "Show Single Problem" is True.
ar: تحديد ما إذا كان الطالب يحصل على رصيد جراء تقييم هذه المسألة. يستخدم فقط عندما يكون إعداد "عرض مسألة واحدة" مضبوطاً على "صحيح".

source: Due date that should be displayed.
ar: التاريخ المقرّر الذي يجب عرضه.

source: Amount of grace to give on the due date.
ar: فترة السماح التي ستعطى بعد التاريخ المقرّر.

source: Student data for a given peer grading problem.
ar: بيانات الطالب لمسألة محدّدة تخضع لتقييم النظراء.

source: Peer Grading Interface
ar: واجهة تقييم النظراء

source: Error
ar: خطأ

source: Courseware
ar: منهاج المساق

source: Course Info
ar: معلومات المساق

source: Progress
ar: التطور

source: Wiki
ar: الويكي

source: Textbooks
ar: الكتب

source: Staff grading
ar: تقييم الطاقم

source: Peer grading
ar: تقييم النظراء

source: Syllabus
ar: مخطط المنهاج الدراسي

source: Instructor
ar: موجّه المساق

source: Text Annotation
ar: إضافات توضيحية نصّيّة

source: Source/Citation
ar: المصدر/الاقتباس

source: Optional for citing source of any material used. Automatic citation can be done using <a href="http://easybib.com">EasyBib</a>
ar: اختياري للاستشهاد بالمصادر المرجعية أية مواد مستخدمة. ويمكن أن يتم الاستشهاد بالمصادر تلقائياً باستخدام <a href="http://easybib.com">EasyBib</a>

source: Diacritic Marks
ar: علامات التشكيل

source: Add diacritic marks to be added to a text using the comma-separated form, i.e. markname;urltomark;baseline,markname2;urltomark2;baseline2
ar: أضف علامات التشكيل التي ستضاف للنص باستخدام صيغة التفريق بالفاصلة، مثال: markname;urltomark;baseline,markname2;urltomark2;baseline2

source: Video Annotation
ar: إضافات توضيحية بمقطع فيديو

source: The external source URL for the video.
ar: الرابط الإلكتروني للمصدر الخارجي الخاص بمقطع الفيديو.

source: Source URL
ar: الرابط للإلكتروني للمصدر

source: Poster Image URL
ar: الرابط الإلكتروني لصورة الملصق

source: Poster URL
ar: الرابط الإلكتروني للملصق

source: Inputs
ar: المدخلات

source: Number of text boxes available for students to input words/sentences.
ar: عدد مربّعات النص المتاحة للطلاب لإدخال الكلمات/الجمل.

source: Maximum Words
ar: الحد الأقصى للكلمات

source: Maximum number of words to be displayed in generated word cloud.
ar: الحد الأقصى لعدد الكلمات التي ستُعرض في سحابة الكلمات التي تمّ إنشاؤها.

source: Show Percents
ar: عرض النسب

source: Statistics are shown for entered words near that word.
ar: يتم عرض إحصاءات الكلمات التي تمّ إدخالها قرب تلك الكلمات.

source: Whether this student has posted words to the cloud.
ar: إذا ما كان هذا الطالب قد نشر كلمات لتعرض ضمن السحابة.

source: Student answer.
ar: إجابة الطالب.

source: All possible words from all students.
ar: كافة الكلمات المحتملة من جميع الطلاب.

source: Top num_top_words words for word cloud.
ar: أفضل num_top_words كلمات لسحابة الكلمات.

source: Self
ar: للتقييم الذاتي

source: AI
ar: للتقييم الآلي

source: Peer
ar: للتقييم من قبل النظراء

source: Not started.
ar: لم يبدأ بعد.

source: Being scored.
ar: جاري تقييمه.

source: Scoring finished.
ar: تم التقييم.

source: Complete.
ar: تم استكماله.

source: Scored rubric
ar: نموذج التقييم المتدرج

source: You have attempted this question {number_of_student_attempts} times. You are only allowed to attempt it {max_number_of_attempts} times.
ar: لقد حاولت الإجابة على هذا السؤال {number_of_student_attempts} مرات، ولا يسمح لك إلا بـ{max_number_of_attempts} محاولة كحدٍّ أقصى.

source: The problem state got out-of-sync. Please try reloading the page.
ar: لم يعد بالإمكان مزامنة المسألة. الرجاء محاولة إعادة تحميل الصفحة.

source: Self-Assessment
ar: التقييم الذاتي

source: Peer-Assessment
ar: تقييم النظراء

source: Instructor-Assessment
ar: تقييم موجّه المساق

source: AI-Assessment
ar: التقييم الآلي

source: Could not find needed tag {tag_name} in the survey responses. Please try submitting again.
ar: لا يمكن إيجاد بطاقة {tag_name} المطلوبة ضمن إجابات المسح الميداني. الرجاء محاولة التقديم مرة ثانية.

source: There was an error saving your feedback. Please contact course staff.
ar: حدث خطأ أثناء حفظ آرائك وتعليقاتك. الرجاء الاتصال بطاقم المساق.

source: Couldn't submit feedback.
ar: لا يمكن تقديم الآراء والتعليقات.

source: Successfully saved your feedback.
ar: تمت بنجاح عملية حفظ الآراء والتعليقات التي قدمتها .

source: Unable to save your feedback. Please try again later.
ar: ليس بالإمكان حفظ الآراء والتعليقات التي قدمتها . الرجاء إعادة المحاولة لاحقاً.

source: Successfully saved your submission.
ar: تمت بنجاح عملية حفظ المواد التي قدّمتها .

source: Unable to submit your submission to the grader. Please try again later.
ar: ليس بالإمكان تقديم المواد التي قدّمتها إلى الأستاذ المسؤول عن عملية التقييم. الرجاء إعادة المحاولة لاحقاً .

source: Error getting feedback from grader.
ar: حدث خطأ أثناء الحصول على الآراء والتعليقات من الأستاذ المسؤول عن التقييم.

source: No feedback available from grader.
ar: لا يوجد آراء وتعليقات من الأستاذ المسؤول عن التقييم.

source: Error handling action. Please try again.
ar: حدث خطأ أثناء إجراء العملية المطلوبة. الرجاء إعادة المحاولة.

source: Your response has been submitted. Please check back later for your grade.
ar: تم تقديم إجابتك. الرجاء التحقق لاحقاً من علامتك.

source: Not started
ar: لم تبدأ بعد

source: In progress
ar: جاري التقييم

source: Done
ar: تمت عملية التقييم

source: We could not find a file in your submission. Please try choosing a file or pasting a URL to your file into the answer box.
ar: لم نستطيع إيجاد ملف ضمن ما قدّمته. الرجاء اختيار ملف أو إضافة عنوان مسار إلكتروني لملفك في المربع الخاص بالإجابة.

source: We are having trouble saving your file. Please try another file or paste a URL to your file into the answer box.
ar: يوجد مشكلة في عملية حفظ الملف الخاص بك. الرجاء إعادة المحاولة بملفٍ مختلف أو إضافة عنوان مسار إلكتروني لملفك في المربع الخاص بالإجابة.

source: Error saving your score. Please notify course staff.
ar: حدث خطأ أثناء حفظ نتيجتك. الرجاء إعلام طاقم المساق.

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
ar: لا يمكن تلقّي النصوص من موقع يوتيوب لمقطع الفيديو {youtube_id}. رمز الحالة: {status_code}.

source: Can't find any transcripts on the Youtube service.
ar: لا يمكن إيجاد أية نصوص على خدمة يوتيوب.

source: We support only SubRip (*.srt) transcripts format.
ar: نحن ندعم بنية النصوص بصيغة SubRip (*.srt) فقط.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
ar: حدث خطأٌ ما في ملفات نصوص SubRip أثناء القيام بعملية التحليل اللغوي. رسالة الخطأ الداخلية هي {error_message}

source: Something wrong with SubRip transcripts file during parsing.
ar: حدث خطأٌ ما في ملفات نصوص SubRip أثناء القيام بعملية التحليل اللغوي.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
ar: {exception_message}: لا يمكن إيجاد النصوص التي تم تحميلها: {user_filename}

source: Basic
ar: الأساسي

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
ar: الرابط الإلكتروني لمقطع الفيديو الخاص بك. يمكن أن يكون رابط عنوان مقطع فيديو على موقع YouTube أو رابط لملف فيديو .mp4 أو .ogg أو .webm في أي موقع على شبكة الانترنت.

source: Default Video URL
ar: الرابط الإلكتروني لمقطع الفيديو الأساسي

source: The name students see. This name appears in the course ribbon and as a header for the video.
ar: الإسم الذي يراه الطلاب. يظهر هذا الإسم في شريط المساق وكعنوان لمقطع الفيديو.

source: Component Display Name
ar: الإسم الظاهر للعنصر

source: Current position in the video.
ar: الموقع الحالي في مقطع الفيديو

source: Optional, for older browsers: the YouTube ID for the normal speed video.
ar: اختياري، لبرامج التصفحّ القديمة: الرمز التعريفي في يوتيوب لمقطع الفيديو ذي السرعة العادية

source: YouTube ID
ar: الرمز التعريفي في يوتيوب

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
ar: اختياري، لبرامج التصفح القديمة: الرمز التعريفي في يوتيوب لمقطع الفيديو الذي تبلغ سرعته .75x .

source: YouTube ID for .75x speed
ar: الرمز التعريفي في يوتيوب لسرعة .75x

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
ar: اختياري، لبرامج التصفح القديمة: الرمز التعريفي في يوتيوب لمقطع الفيديو الذي تبلغ سرعته 1.25x.

source: YouTube ID for 1.25x speed
ar: الرمز التعريفي في يوتيوب لسرعة 1.25x

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
ar: اختياري، لبرامج التصفح القديمة: الرمز التعريفي في يوتيوب لمقطع الفيديو الذي تبلغ سرعته 1.5x.

source: YouTube ID for 1.5x speed
ar: الرمز التعريفي في يوتيوب لسرعة 1.5x
