Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/django-partial.po
Languages: ar

source: Open Ended Panel
ar: لوحة ذات النهايات المفتوحة

source: Discussion
ar: المناقشة

source: Problem
ar: المسألة

source: Advanced
ar: المتقدم

source: Honor Code Certificate
ar: شهادة ميثاق شرف

source: Enrollment is closed
ar: التسجيل في المساق غير متاح

source: Enrollment mode not supported
ar: وضع التسجيل غير مدعوم

source: Invalid amount selected.
ar: تم اختيار مبلغ غير صحيح.

source: No selected price or selected price is too low.
ar: لم يتم اختيار سعر أو أن السعر الذي تم اختياره قليل جداً.

source: Administrator
ar: المدير

source: Moderator
ar: المشرف

source: Community TA
ar: المساعد المشرف على المجموعة

source: Student
ar: الطالب

source: Your account has been disabled. If you believe this was done in error, please contact us at {link_start}{support_email}{link_end}
ar: تم إيقاف حسابك. إذا كنت تعتقد أن ذلك تم عن طريق الخطأ، يرجى الاتصال بنا على {link_start}{support_email}{link_end}

source: Disabled Account
ar: حساب تم إيقافه

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Other
ar: غير ذلك

source: Doctorate
ar: دكتوراة

source: Master's or professional degree
ar: شهادة الماجستير أو شهادة احترافية

source: Bachelor's degree
ar: درجة البكالوريوس

source: Associate's degree
ar: درجة الزمالة

source: Secondary/high school
ar: الدراسة الثانوية

source: Junior secondary/junior high/middle school
ar: الثانوية الصغرى/الإعدادية/المتوسّطة

source: Elementary/primary school
ar: الابتدائية

source: None
ar: لا شيء

source: Course id not specified
ar: رقم المساق غير محدد

source: Course id is invalid
ar: رقم المساق غير صحيح

source: Course is full
ar: المساق ممتلئ بالكامل

source: You are not enrolled in this course
ar: أنت غير مسجّل في هذا المساق

source: Enrollment action is invalid
ar: عملية التسجيل غير صحيحة

source: There is no {platform_name} account associated with your {provider_name} account. Please use your {platform_name} credentials or pick another provider.
ar: لا وجود لحساب {platform_name} مرتبط بحساب {provider_name}. الرجاء استخدام بيانات التحقّق من الهوية الخاصة بك {platform_name} أو اختيار مقدّم خدمات آخر.

source: There was an error receiving your login information. Please email us.
ar: حدث خطأ في استقبال بيانات تسجيل الدخول. الرجاء مراسلتنا عبر بريدنا الإلكتروني.

source: This account has been temporarily locked due to excessive login failures. Try again later.
ar: تم إغلاق هذا الحساب مؤقّتاً نظراً للعدد الزائد من محاولات لتسجيل الدخول الفاشلة. الرجاء إعادة المحاولة في وقتٍ لاحق.

source: Your password has expired due to password policy on this account. You must reset your password before you can log in again. Please click the "Forgot Password" link on this page to reset your password before logging in again.
ar: لقد انتهت صلاحية كلمة السر الخاصة بك نظراً لسياسة كلمة السر المرتبطة بهذا الحساب. ينبغي أن تقوم بإعادة ضبط كلمة السر الخاصة بك لتتمكّن من تسجيل الدخول مجدّداً. الرجاء الضغط على رابط "نسيت كلمة السر" على هذه الصفحة لإعادة ضبط كلمة السر قبل إعادة محاولة تسجيل الدخول.

source: Too many failed login attempts. Try again later.
ar: محاولات تسجيل دخول غير ناجحة كثيرة. الرجاء إعادة المحاولة لاحقاً.

source: Email or password is incorrect.
ar: البريد الإلكتروني أو كلمة السر غير صحيحة

source: This account has not been activated. We have sent another activation message. Please check your e-mail for the activation instructions.
ar: لم يتم تفعيل هذا الحساب. لقد قمنا بإرسال رسالة تفعيل أخرى لك. الرجاء تفقّد بريدك الإلكتروني لمعرفة تعليمات التفعيل.

source: Please enter a username
ar: يرجى ادخال اسم المستخدم

source: Please choose an option
ar: يرجى اختيار أحد الخيارات

source: User with username {} does not exist
ar: اسم المستخدم {} غير موجود

source: Successfully disabled {}'s account
ar: تم إيقاف حساب {} بنجاح

source: Successfully reenabled {}'s account
ar: تمت إعادة تفعيل حساي {} بنجاح

source: Unexpected account status
ar: حالة غير متوقعة للحساب

source: An account with the Public Username '{username}' already exists.
ar: يوجد بالفعل حساب باسم المستخدم العلني '{username}'.

source: An account with the Email '{email}' already exists.
ar: يوجد بالفعل حساب يستخدم البريد الإلكتروني '{email}'.

source: Error (401 {field}). E-mail us.
ar: خطأ (401 {field}). الرجاء مراسلتنا عبر بريدنا الإلكتروني.

source: To enroll, you must follow the honor code.
ar: للتسجيل، يتعين عليك اتباع ميثاق الشرف.

source: You must accept the terms of service.
ar: يجب الموافقة على شروط الخدمة.

source: Username must be minimum of two characters long
ar: يجب أن يكون اسم المستخدم أكثر من حرفين.

source: A properly formatted e-mail is required
ar: يجب إدخال عنوان بريد إلكتروني بالصيغة الصحيحة

source: Your legal name must be a minimum of two characters long
ar: يجب أن يكون اسمك القانوني بطول حرفين في الحد الأدنى

source: A valid password is required
ar: يجب إدخال كلمة سر صحيحة

source: Accepting Terms of Service is required
ar: يتعين قبول شروط الخدمة

source: Agreeing to the Honor Code is required
ar: يتعين الموافقة على الالتزام بميثاق الشرف

source: A level of education is required
ar: يجب إدخال المستوى التعليمي

source: Your gender is required
ar: يجب إدخال جنس الطالب

source: Your year of birth is required
ar: يجب إدخال سنة ميلادك

source: Your mailing address is required
ar: يجب إدخال عنوانك البريدي

source: A description of your goals is required
ar: يجب إدخال الأهداف التي ترغب في تحقيقها

source: A city is required
ar: يجب إدخال المدينة

source: A country is required
ar: يجب إدخال الدولة

source: Username cannot be more than {0} characters long
ar: لا يجب أن يكون اسم المستخدم أطول من {0} حرفاً

source: Email cannot be more than {0} characters long
ar: لا يجب أن يكون عنوان البريد الإلكتروني أطول من {0} حرفاً

source: Valid e-mail is required.
ar: مطلوب بريد إلكتروني صحيح.

source: Username should only consist of A-Z and 0-9, with no spaces.
ar: اسم المستخدم يجب أن لا يحتوى إلا على الحروف A-Z والأرقام 0-9 وبدون استخدام مسافات.

source: Password:
ar: كلمة السر:

source: Could not send activation e-mail.
ar: لم نتمكن من إرسال رسالة التفعيل.

source: Unknown error. Please e-mail us to let us know how it happened.
ar: خطأ غير معلوم. الرجاء مراسلتنا عبر بريدنا الإلكتروني لإعلامنا بكيفية حدوثه.

source: You are re-using a password that you have used recently. You must have {0} distinct password(s) before reusing a previous password.
ar: أنت تحاول إعادة استخدام كلمة سر كنت قد استعملتها مؤخّراً. يجب أن تستخدم {0} كلمة (كلمات) سر مميّزة قبل إعادة استخدام واحدة مستخدمة مسبقاً.

source: You are resetting passwords too frequently. Due to security policies, {0} day(s) must elapse between password resets
ar: أنت تقوم بإعادة ضبط كلمة السر بشكلٍ متكرّر أكثر من اللازم. نظراً للسياسات الخاصة بأمن المعلومات، يتعيّن مرور {0} يوم (أيام) بين كل عملية تغيير لكلمة سر والتي تليها.

source: Password reset unsuccessful
ar: تم بنجاح تغيير كلمة السر

source: No inactive user with this e-mail exists
ar: لا يوجد مستخدم غير فعال بهذا البريد الإلكتروني.

source: Unable to send reactivation email
ar: لم نتمكن من إرسال رسالة إعادة التفعيل.

source: Invalid password
ar: كلمة السر غير صحيحة

source: Valid e-mail address required.
ar: مطلوب بريد إلكتروني صحيح.

source: An account with this e-mail already exists.
ar: يوجد بالفعل حساب يستخدم هذا البريد الإلكتروني.

source: Old email is the same as the new email.
ar: البريد الإلكتروني القديم مطابق للبريد الإلكتروني الجديد.

source: Name required
ar: الاسم مطلوب

source: Invalid ID
ar: الهوية الشخصية غير صحيحة

source: LONG_DATE_FORMAT
ar: "%A, %B %d %Y"

source: DATE_TIME_FORMAT
ar: "%b %d, %Y at %H:%M"

source: SHORT_DATE_FORMAT
ar: "%b %d %Y"

source: TIME_FORMAT
ar: %H:%M:%S"

# am/pm indicator
source: AM
ar: صباحاً

# am/pm indicator
source: PM
ar: مساءً

# weekday name
source: Monday
ar: الإثنين

# weekday name
source: Tuesday
ar: الثلاثاء

# weekday name
source: Wednesday
ar: الأربعاء

# weekday name
source: Thursday
ar: الخميس

# weekday name
source: Friday
ar: الجمعة

# weekday name
source: Saturday
ar: السبت

# weekday name
source: Sunday
ar: الأحد

# abbreviated weekday name
source: Mon
ar: الإثنين

# abbreviated weekday name
source: Tue
ar: الثلاثاء

# abbreviated weekday name
source: Wed
ar: الأربعاء

# abbreviated weekday name
source: Thu
ar: الخميس

# abbreviated weekday name
source: Fri
ar: الجمعة

# abbreviated weekday name
source: Sat
ar: السبت

# abbreviated weekday name
source: Sun
ar: الأحد

# abbreviated month name
source: Jan
ar: يناير

# abbreviated month name
source: Feb
ar: فبراير

# abbreviated month name
source: Mar
ar: مارس

# abbreviated month name
source: Apr
ar: أبريل

# abbreviated month name
source: May
ar: مايو

# abbreviated month name
source: Jun
ar: يونيو

# abbreviated month name
source: Jul
ar: يوليو

# abbreviated month name
source: Aug
ar: أغسطس

# abbreviated month name
source: Sep
ar: سبتمبر

# abbreviated month name
source: Oct
ar: أكتوبر

# abbreviated month name
source: Nov
ar: نوفمبر

# abbreviated month name
source: Dec
ar: ديسمبر

# month name
source: January
ar: يناير

# month name
source: February
ar: فبراير

# month name
source: March
ar: مارس

# month name
source: April
ar: أبريل

# month name
source: May
ar: مايو

# month name
source: June
ar: يونيو

# month name
source: July
ar: يوليو

# month name
source: August
ar: أغسطس

# month name
source: September
ar: سبتمبر

# month name
source: October
ar: أكتوبر

# month name
source: November
ar: نوفمبر

# month name
source: December
ar: ديسمبر

source: Invalid Length ({0})
ar: عدد الأحرف غير صحيح ({0})

source: must be {0} characters or more
ar: يجب أن يكون عدد الأحرف {0} أو أكثر

source: must be {0} characters or less
ar: يجب أن يكون عدد الأحرف {0} أو أقل

source: Must be more complex ({0})
ar: يجب أن تكون أكثر تعقيداً ({0})

source: must contain {0} or more uppercase characters
ar: يجب أن تحتوي على {0} أو أكثر من الحروف الإنجليزية الكبيرة

source: must contain {0} or more lowercase characters
ar: يجب أن تحتوي على {0} أو أكثر من الحروف الإنجليزية الصغيرة

source: must contain {0} or more digits
ar: يجب أن تحتوي على {0} أو أكثر من الأرقام

source: must contain {0} or more punctuation characters
ar: يجب أن تحتوي على {0} أو أكثر من علامات الترقيم

source: must contain {0} or more non ascii characters
ar: يجب أن تحتوي على {0} أو أكثر من الأحرف التي لا تنتمي لمجموعة آسكي ascii

source: must contain {0} or more unique words
ar: يجب أن تحتوي على {0} أو أكثر من الكلمات المميّزة

source: Too similar to a restricted dictionary word.
ar: مشابهة جداً لإحدى الكلمات غير المقبولة في القاموس.

source: Cannot rescore problems with possible file submissions
ar: لا يمكن إعادة تقييم المسائل التي يحتمل فيها تقديم ملفات

source: correct
ar: صحيح

source: incorrect
ar: غير صحيح

source: incomplete
ar: ناقص

source: unanswered
ar: لم تتم الإجابة عليه

source: processing
ar: جاري إتمام العملية

source: ChoiceGroup: unexpected tag {tag_name}
ar: ChoiceGroup: بطاقة تعريف غير متوقّعة {tag_name}

source: Answer received.
ar: تمّ تلقّي الإجابة.

source: Expected a <choice> tag; got {given_tag} instead
ar: توقّع بطاقة تعريف <choice>؛ تمّ تلقي {given_tag} بدلاً من ذلك

source: Your file(s) have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ar: تم تقديم ملفك (ملفاتك). وحالما يتم تقييمه، سيتم استبدال هذه الرسالة بآراء وملاحظات الأستاذ المسؤول عن التقييم.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
ar: تم تقديم إجابتك، وحالما يتم تقييمها، سيتم استبدال هذه الرسالة بآراء وملاحظات الأستاذ المسؤول عن التقييم.

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
ar: تم التقديم. وحالما يتم الحصول على استجابة بهذا الشأن، سيتم استبدال هذه الرسالة بتلك الآراء والملاحظات.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
ar: لم يرد أي ردّ من Xqueue في غضون {xqueue_timeout} ثواني. تمّ إيقاف العملية.

source: Error {err} in evaluating hint function {hintfn}.
ar: خطأ {err} في تقييم وظيفة النصح {hintfn}.

source: (Source code line unavailable)
ar: (السطر من الكود الأصلي غير متوفّر)

source: See XML source line {sourcenum}.
ar: الرجاء الاطلاع على سطر الكود الأساسي المكتوب بـ XML {sourcenum}.

source: Execution of unsafe Javascript code is not allowed.
ar: لا يسمح بتنفيذ برمجية جافا سكريبت غير آمنة.

source: unmask_name called on response that is not masked
ar: unmask_name الرد غير المحجوب

source: Do not use shuffle and answer-pool at the same time
ar: الرجاء عدم استخدام shuffle وanswer-pool في الوقت نفسه

source: answer-pool value should be an integer
ar: يجب أن تكون قيمة answer-pool عدداً صحيحاً

source: Choicegroup must include at least 1 correct and 1 incorrect choice
ar: يجب أن يتضمّن Choicegroup على الأقل 1 خياراً صحيحاً و1 خياراً غير صحيح

source: There was a problem with the staff answer to this problem.
ar: كانت هناك مشكلة في الجواب المقدّم من قبل أعضاء هيئة التدريس على هذه المسألة.

source: Could not interpret '{student_answer}' as a number.
ar: ليس بالإمكان ترجمة ’{student_answer}‘ بشكل رقم.

source: You may not use variables ({bad_variables}) in numerical problems.
ar: لا يجوز استخدام متغيّرات ({bad_variables}) في المسائل العددية.

source: factorial function evaluated outside its domain:'{student_answer}'
ar: تم تقييم وظيفة إيجاد مضروب العدد خارج نطاق مجالها: ’{student_answer}‘

source: Invalid math syntax: '{student_answer}'
ar: كتابة الصيغة الرياضية غير صحيحة: ’{student_answer}‘

source: You may not use complex numbers in range tolerance problems
ar: يجب عدم استخدام الأعداد المركبة في المسائل المتعلقة بنطاق التحمّل

source: There was a problem with the staff answer to this problem: complex boundary.
ar: كان هناك مشكلة في ما يتعلق بإجابة طاقم المقرّر على هذه المسألة: الحدود المركّبة.

source: There was a problem with the staff answer to this problem: empty boundary.
ar: كان هناك مشكلة في ما يتعلق بإجابة طاقم المقرّر على هذه المسألة: الحدود الفارغة.

source: error
ar: خطأ

source: or
ar: أو

source: error getting student answer from {student_answers}
ar: حدث خطأ في الحصول على إجابة الطالب من {student_answers}

source: No answer entered!
ar: لم يتمّ إدخال أي إجابة!

source: CustomResponse: check function returned an invalid dictionary!
ar: CustomResponse: وظيفة التحقق رجعت بدليل غير صحيح!

source: An error occurred with SymbolicResponse. The error was: {error_msg}
ar: حدث خطأ في SymbolicResponse. كان الخطأ: {error_msg}

source: No answer provided.
ar: لم يتمّ تقديم أي جواب.

source: Error: No grader has been set up for this problem.
ar: خطأ: لم يتمّ تحديد المسؤول عن التقييم لهذه المسألة.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
ar: ليس بالإمكان إيصال الملف الذي قدّمته للأستاذ المسؤول عن التقييم (السبب: {error_msg}). الرجاء إعادة المحاولة لاحقاً.

source: Invalid grader reply. Please contact the course staff.
ar: رد الأستاذ المسؤول عن التقييم غير صحيح. الرجاء الاتصال مع طاقم المساق.

source: Invalid input: {bad_input} not permitted in answer.
ar: مدخلات غير صحيحة: {bad_input} غير مسموح بها في الإجابة.

source: factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
ar: وظيفة مضروب العدد غير مسموحة كإجابة على هذه المسألة. الإجابة المقدّمة كانت: {bad_input}

source: Invalid input: Could not parse '{bad_input}' as a formula.
ar: إدخال غير صحيح: ليس بالإمكان تجزئة ’{bad_input}‘ كصيغة.

source: Invalid input: Could not parse '{bad_input}' as a formula
ar: إدخال غير صحيح: ليس بالإمكان تجزئة ’{bad_input}‘ كصيغة

source: Error in evaluating SchematicResponse. The error was: {error_msg}
ar: خطأ في تقييم SchematicResponse. الخطأ كان: {error_msg}

source: error grading {image_input_id} (input={user_input})
ar: حدث خطأ في التقييم {image_input_id} (input={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
ar: حدث خطأ في توصيف المسألة! التحليل النصي غير ممكن للمستطيل في {sr_coords}

source: Answer not provided for {input_type}
ar: لم يتمّ تقديم إجابة لـ {input_type}

source: The Staff answer could not be interpreted as a number.
ar: ليس بالإمكان ترجمة إجابة الطاقم بشكل عدد.

source: Could not interpret '{given_answer}' as a number.
ar: ليس بالإمكان ترجمة ’{given_answer}‘ بشكل عدد.

source: XML data for the annotation
ar: بيانات XML للحواشي

source: Display Name
ar: الإسم الظاهر

source: Display name for this module
ar: الإسم الظاهر لهذه الوحدة

source: Annotation
ar: إضافات توضيحية

source: This name appears in the horizontal navigation at the top of the page.
ar: يظهر هذا الإسم في سطر التصفّح الأفقي أعلى الصفحة.

source: Number of attempts taken by the student on this problem
ar: عدد المحاولات التي قام بها الطالب على هذه المسألة

source: Maximum Attempts
ar: الحد الأقصى للمحاولات

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
ar: تحديد عدد المرات التي يمكن للطالب فيها محاولة الإجابة على هذه المسألة. إذا لم يتمّ تحديد العدد، يسمح بعدد غير محدود من المحاولات .

source: Date that this problem is due by
ar: التاريخ النهائي المقرّر لحل هذه المسألة

source: Date that this problem is due by for a particular student. This can be set by an instructor, and will override the global due date if it is set to a date that is later than the global due date.
ar: التاريخ النهائي المقرّر لحل هذه المسألة بالنسبة لطالب معيّن. يمكن أن يقوم بتحديد ذلك موجّه معيّن، وسيلغي ذلك التاريخ المقرّر الشامل في حال كان التاريخ المحدد يتجاوز التاريخ المقرّر الشامل.

source: Amount of time after the due date that submissions will be accepted
ar: الفترة بعد مرور التاريخ المقرّر التي سيتمّ خلالها قبول ما يقوم الطلاب بتقديمه فيها

source: Show Answer
ar: إظهار الإجابات

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
ar: تحديد متى يتمّ إظهار الجواب للمسألة. يمكن تحديد قيمة أساسيّة في الإعدادات المتقدّمة.

source: Always
ar: دائماً

source: Answered
ar: تمّت الإجابة

source: Attempted
ar: تمّت محاولة الإجابة

source: Closed
ar: تمّ الإغلاق

source: Finished
ar: تمّ الانتهاء

source: Past Due
ar: انقضى التاريخ المقرّر

source: Never
ar: أبداً

source: Whether to force the save button to appear on the page
ar: اختيار فرض إظهار زرّ الحفظ على الصفحة

source: Randomization
ar: الترتيب العشوائي

source: Defines how often inputs are randomized when a student loads the problem. This setting only applies to problems that can have randomly generated numeric values. A default value can be set in Advanced Settings.
ar: تحديد عدد المرات التي يتمّ فيها إعادة ترتيب المدخلات بشكل عشوائي عندما يقوم طالب بتحميل المسألة. ينطبق هذا الإعداد فقط على المسائل التي تتضمّن خيارات ذات قيم رقمية تم توليدها بشكل عشوائي. يمكن ضبط قيمة أساسية أولية في الإعدادات المتقدّمة.

source: On Reset
ar: تجري إعادة الضبط

source: Per Student
ar: لكل طالب

source: XML data for the problem
ar: بيانات XML للمسألة

source: Dictionary with the correctness of current student answers
ar: قاموس مع تصحيح إجابات الطالب الحالية

source: Dictionary for maintaining the state of inputtypes
ar: قاموس للحفاظ على حالة أنواع المدخلات

source: Dictionary with the current student responses
ar: قاموس مع ردود الطالب الحالية

source: Whether the student has answered the problem
ar: إذا ما كان الطالب قد أجاب على المسألة

source: Random seed for this student
ar: الجذر الأولي العشوائي لهذا الطالب

source: Last submission time
ar: الوقت الأخير المسموح لتقديم الورقة

source: Timer Between Attempts
ar: المؤقّت بين المحاولات

source: Seconds a student must wait between submissions for a problem with multiple attempts.
ar: عدد الثواني التي يجب أن ينتظرها الطالب ما بين الإجابات التي يقدّمها عن مسألة ذات محاولات متعدّدة.

source: Problem Weight
ar: وزن المسألة

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
ar: تحديد عدد النقاط التي تستحقّها كلّ مسألة. إذا لم يتمّ ضبط القيمة، يستحق كل حقل ردّ في المسألة نقطة واحدة.

source: Markdown source of this module
ar: مصدر مارك داون لهذه الوحدة

source: Source code for LaTeX and Word problems. This feature is not well-supported.
ar: التعليمات البرمجية الأصلية لمسائل Word وLaTeX . هذه الميزة غير مدعومة بشكل جيد.

source: String customization substitutions for particular locations
ar: بدائل تعديل النص لمواقع محدّدة

source: Enable LaTeX templates?
ar: هل ترغب في تفعيل نماذج LaTeX ؟

source: Check
ar: تحقق

source: Final Check
ar: تحقق أخير

source: Checking...
ar: جاري التحقّق...

source: Warning: The problem has been reset to its initial state!
ar: تحذير: تم إعادة المسألة إلى حالتها الأولية!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
ar: تم إفساد حالة المسألة من خلال ملف تقديم غير صحيح. حيث كان الملف المقدّم مؤلّفاً من:

source: If this error persists, please contact the course staff.
ar: إذا استمر ظهور نفس هذا الخطأ، الرجاء الاتصال بطاقم المساق.

source: Problem is closed.
ar: تم إغلاق المسألة.

source: Problem must be reset before it can be checked again.
ar: ينبغي إعادة ضبط المسألة قبل أن يصبح بالإمكان التحقق منها مرّةً أخرى.

source: You must wait at least {wait} seconds between submissions.
ar: يجب أن تنتظر مدةً وقدرها {wait} ثواني ما بين كل عملية تقديم وأخرى.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
ar: ينبغي الانتظار مدة {wait_secs} على الأقل ما بين كل عملية تقديم وأخرى. {remaining_secs} ثانية متبقّية.

source: Error: {msg}
ar: خطأ: {msg}

source: {num_hour} hour
ar: {num_hour} ساعة

source: {num_minute} minute
ar: {num_minute} دقيقة

source: {num_second} second
ar: {num_second} ثانية

source: Problem's definition does not support rescoring.
ar: بيانات التعريف الخاصة بالمسالة لا تدعم عملية إعادة التقييم.

source: Problem must be answered before it can be graded again.
ar: ينبغي الإجابة على المسالة قبل أن يمكن تقييمها مرةً أخرى.

source: Problem needs to be reset prior to save.
ar: ينبغي إعادة ضبط المسألة قبل إجراء عملية الحفظ.

source: Your answers have been saved.
ar: تم حفظ إجاباتك.

source: Your answers have been saved but not graded. Click 'Check' to grade them.
ar: تم حفظ إجاباتك لكن لم يتم تقييمها بعد. اضغط على ’التحقق‘ لإجراء عملة التقييم.

source: Refresh the page and make an attempt before resetting.
ar: قم بتحديث الصفحة وحاول مرةً أخرى قبل إعادة الضبط.

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
ar: نعتذر على حدوث خطأ أثناء تنفيذ طلبك. الرجاء إعادة تحميل صفحتك ومن ثمّ المحاولة مرةً أخرى.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
ar: تغيّرت حالة هذه المسألة منذ قيامك بتحميل هذه الصفحة. الرجاء تحديث صفحتك.

source: Open Response Assessment
ar: فتح تقييم الرد

source: Current task that the student is on.
ar: المهمّة الحالية التي يعمل عليها الطالب.

source: A list of lists of state dictionaries for student states that are saved.This field is only populated if the instructor changes tasks afterthe module is created and students have attempted it (for example changes a self assessed problem to self and peer assessed.
ar: قائمة من قوائم قواميس الحالة الخاصة بحالات الطالب التي تمّ حفظها. تتمّ تعبئة هذا الحقل فقط إذا قام الموجّه بتغيير المهام بعد إنشاء الوحدة ومحاولة الطلاب إنجازها (على سبيل المثال تغيير مسألة خاضعة للتقييم الذاتي إلى مسألة خاضعة للتقييم الذاتي ومن قبل النظراء.

source: List of state dictionaries of each task within this module.
ar: قائمة بقواميس الحالة الخاصة بكلّ مهمّة ضمن هذه الوحدة.

source: Which step within the current task that the student is on.
ar: الخطوة التي يعمل عليها الطالب ضمن المهمة الحالية .

source: Graded
ar: تم تقييمه

source: Defines whether the student gets credit for this problem. Credit is based on peer grades of this problem.
ar: تحديد ما إذا كان الطالب سيحصل على رصيد لهذه المسألة. يستند الرصيد إلى تقييم النظراء لهذه المسألة.

source: If the problem is ready to be reset or not.
ar: هل المسألة جاهزة لإعادة الضبط أم لا.
