Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/djangojs-partial.po
Languages: ar

source: OK
ar: حسناً

source: Cancel
ar: إلغاء

source: This link will open in a new browser window/tab
ar: هذا الرابط سيُفتح في نافذة/علامة تبويب جديدة

source: Delete
ar: حذف

source: Show Annotations
ar: إظهار الحواشي

source: Hide Annotations
ar: إخفاء الحواشي

source: Expand Instructions
ar: تكبير شاشة التعليمات

source: Collapse Instructions
ar: تصغير شاشة التعليمات

source: Commentary
ar: التعليق

source: Reply to Annotation
ar: الرد على الحواشي

source: (%(earned)s/%(possible)s point)
ar: (%(earned)s/%(possible)s نقطة)

source: (%(num_points)s point possible)
ar: (%(num_points)s نقاط محتملة)

source: Answer:
ar: الإجابة:

source: Hide Answer
ar: إخفاء الإجابات

source: Show Answer
ar: إظهار الإجابات

source: Reveal Answer
ar: كشف الإجابات

source: Answer hidden
ar: الإجابة مخفيّة

source: unanswered
ar: لم تتم الإجابة عليه

source: Status: unsubmitted
ar: الحالة: لم يتم تقديمها

source: You need to pick a rating before you can submit.
ar: يتعين عليك اختيار تقدير قبل أن تقوم بالتقديم.

source: Your score did not meet the criteria to move to the next step.
ar: درجتك لا تلبي المعيار المطلوب للانتقال إلى الخطوة التالية.

source: Submit
ar: تقديم

source: Submit assessment
ar: تقديم التقييم

source: Your response has been submitted. Please check back later for your grade.
ar: تم تقديم إجابتك. الرجاء التحقق لاحقاً من درجتك.

source: Submit post-assessment
ar: تقديم تقييم المشاركة

source: Answer saved, but not yet submitted.
ar: تم حفظ الإجابة، لكن لم يتم تقديمها بعد.

source: Please confirm that you wish to submit your work. You will not be able to make any changes after submitting.
ar: الرجاء التأكيد على رغبتك تقديم ملفاتك، حيث لن تتمكن من إجراء أية تعديلات بعد أن تقوم بالتقديم.

source: You are trying to upload a file that is too large for our system. Please choose a file under 2MB or paste a link to it into the answer box.
ar: أنت تحاول تحميل ملف بحجم يزيد عن الحد المقبول بالنسبة للنظام لدينا. الرجاء اختيار ملف بحجم لا يتجاوز 2 ميغابايت أو إدخال رابط إلى الملف في المربع المخصص للإجابة.

source: Are you sure you want to remove your previous response to this question?
ar: هل أنت متأكد من رغبتك إزالة إجابتك السابقة على هذا السؤال؟

source: Moved to next step.
ar: تم الانتقال إلى الخطوة التالية.

source: File uploads are required for this question, but are not supported in your browser. Try the newest version of Google Chrome. Alternatively, if you have uploaded the image to another website, you can paste a link to it into the answer box.
ar: هذا السؤال يتطلّب تحميل ملفات، لكن المتصفح الخاص بك لا يدعم هذه العملية. حاول تحميل الإصدار الأخير من متصفح جوجل كروم، أو كبديلٍ عن ذلك، في حال قمت بتحميل الصورة إلى موقع مختلف، فبإمكانك وضع رابط إليها في المربع المخصص للإجابة.

source: Show Question
ar: إظهار السؤال

source: Hide Question
ar: إخفاء السؤال

source: Sequence error! Cannot navigate to tab %(tab_name)s in the current SequenceModule. Please contact the course staff.
ar: خطأ في التسلسل! ليس بالإمكان الانتقال إلى علامة التبويب %(tab_name)s في الـSequenceModule الحالي. الرجاء الاتصال بطاقم المساق.

source: Volume
ar: الصوت

source: Muted
ar: كتم الصوت

source: Very low
ar: منخفض جداً

source: Low
ar: منخفض

source: Average
ar: متوسط

source: Loud
ar: عالي

source: Very loud
ar: عالي جداً

source: Maximum
ar: الحد الأقصى

source: VideoPlayer: Element corresponding to the given selector does not found.
ar: VideoPlayer: لم يتمّ العثور على العنصر الذي يتوافق مع آلية الانتقاء المحددة.

source: This browser cannot play .mp4, .ogg, or .webm files.
ar: ليس بإمكان هذا المتصفّح تشغيل الملفات التي تحمل اللاحقة .mp4 أو .ogg أو .webm

source: Try using a different browser, such as Google Chrome.
ar: الرجاء محاولة استخدام متصفّح آخر، مثل جوجل كروم.

source: Video slider
ar: تمرير مقطع الفيديو

source: Pause
ar: إيقاف

source: Play
ar: تشغيل

source: Fill browser
ar: ملء المتصفح

source: Exit full browser
ar: الخروج من المتصفح

source: HD on
ar: الدقة العالية مفعّلة

source: HD off
ar: الدقة العالية غير مفعّلة

source: Video position
ar: تحديد الموضع على مقطع الفيديو

source: Video ended
ar: انتهى مقطع الفيديو

source: %(value)s hour
ar: ساعات %(value)s

source: %(value)s minute
ar: دقائق %(value)s

source: %(value)s second
ar: ثواني %(value)s

source: Caption will be displayed when
ar: سيتم عرض العنوان الفرعي عند

source: Turn on captions
ar: تشغيل العناوين الفرعية

source: Turn off captions
ar: إيقاف العناوين الفرعية

source: Hide Discussion
ar: إخفاء النقاش

source: Show Discussion
ar: إظهار النقاش

source: Sorry
ar: عذراً

source: We had some trouble loading the discussion. Please try again.
ar: هناك مشكلة ما في عملية تحميل النقاش. الرجاء إعادة المحاولة لاحقاً.

source: We had some trouble loading the threads you requested. Please try again.
ar: هناك مشكلة ما في عملية تحميل المواضيع التي طلبتها. الرجاء إعادة المحاولة لاحقاً.

source: Loading content
ar: جاري تحميل المحتوى

source: We had some trouble processing your request. Please ensure you have copied any unsaved work and then reload the page.
ar: هناك مشكلة ما في عملية تنفيذ طلبك. الرجاء التأكد من قيامك بنسخ أي مواد لم يتم حفظها إلى مكان آخر، ومن ثمّ قم بإعادة تحميل الصفحة.

source: We had some trouble processing your request. Please try again.
ar: واجهتنا بعض المشكلات أثناء إجراء العمليات الخاصة بطلبك. الرجاء إعادة المحاولة.

source: Close
ar: إغلاق

source: Open
ar: فتح

source: remove vote
ar: إزالة التصويت

source: vote
ar: تصويت

source: vote (click to remove your vote)
ar: التصويت ( اضغط هتا لإلغاء التصويت)

source: vote (click to vote)
ar: التصويت (اضغط هنا للتصويت)

source: Load more
ar: تحميل المزيد

source: Loading more threads
ar: تحميل المزيد من المواضيع

source: We had some trouble loading more threads. Please try again.
ar: هناك مشكلة ما في عملية تحميل المزيد من المواضيع. الرجاء إعادة المحاولة.

source: %(unread_count)s new comment
ar: تعليق جديد %(unread_count)s

source: Loading thread list
ar: تحميل قائمة المواضيع

source: Click to remove report
ar: اضغط هنا لإزالة التقرير

source: Misuse Reported%(start_sr_span)s, click to remove report%(end_span)s
ar: تم الإبلاغ عن إساءة استخدام %(start_sr_span)s، أنقر هنا لحذف التقرير %(end_span)s

source: Report Misuse
ar: الإبلاغ عن إساءة استعمال

source: Pinned%(start_sr_span)s, click to unpin%(end_span)s
ar: مُثبَّت %(start_sr_span)s، أنقر لإزالة التثبيت %(end_span)s

source: Click to unpin
ar: أنقر لإزالة التثبيت

source: Pinned
ar: مُثبَّت

source: Pin Thread
ar: ثبّت الموضوع

source: The thread you selected has been deleted. Please select another thread.
ar: الموضوع الذي قمت باختياره قد تم إلغاؤه. الرجاء اختيار موضوع آخر.

source: We had some trouble loading responses. Please reload the page.
ar: هناك مشكلة ما في عملية تحميل الردود. الرجاء إعادة تحميل الصفحة.

source: We had some trouble loading more responses. Please try again.
ar: هناك مشكلة ما في عملية تحميل المزيد من الردود. الرجاء إعادة المحاولة.

source: %(numResponses)s response
ar: ردود %(numResponses)s

source: Showing all responses
ar: إظهار كافة الردود

source: Showing first response
ar: عرض %(numResponses)s ردود الأولى

source: Load all responses
ar: تحميل كافة الردود

source: Load next %(numResponses)s responses
ar: تحميل الـ %(numResponses)s رداً التالية

source: Are you sure you want to delete this post?
ar: هل أنت متأكد من أنك تودّ إلغاء هذه المشاركة؟

source: We had some trouble loading the page you requested. Please try again.
ar: هناك مشكلة في عملية تحميل الصفحة التي طلبتها. الرجاء إعادة المحاولة لاحقاً.

source: anonymous
ar: مجهول

source: staff
ar: طاقم المساق

source: Community TA
ar: مساعد المشرف للمجموعة

source: Misuse Reported, click to remove report
ar: تم الإبلاغ عن إساءة الاستخدام، اضغط لإزالة التقرير

source: Are you sure you want to delete this comment?
ar: هل أنت متأكد من رغبتك إلغاء هذا التعليق؟

source: We had some trouble deleting this comment. Please try again.
ar: حدثت مشكلة ما لدى محاولة إلغاء هذا التعليق. الرجاء إعادة المحاولة.

source: Are you sure you want to delete this response?
ar: هل أنت متأكد من أنك تودّ إلغاء هذا الرد؟

source: Drop target image
ar: إسقاط الصورة المطلوبة

source: dragging out of slider
ar: السحب خارج شريط التمرير

source: dragging
ar: السحب

source: dropped in slider
ar: تمّ الإسقاط في شريط التمرير

source: dropped on target
ar: تمّ الإسقاط على الهدف

source: %s ago
ar: من %s ثانية مضت

source: %s from now
ar: %s ثانية من الآن

source: less than a minute
ar: أقل من دقيقة

source: about a minute
ar: حوالي الدقيقة

source: %d minute
ar: %d دقيقة

source: about an hour
ar: حوالي الساعة

source: about %d hour
ar: حوالي %d ساعة

source: a day
ar: يوم واحد

source: %d day
ar: %d يوم

source: about a month
ar: حوالي الشهر

source: %d month
ar: %d شهر

source: about a year
ar: حوالي السنة

source: %d year
ar: %d سنة

source: User
ar: المستخدم

source: Annotation
ar: إضافات توضيحية

source: My Notes
ar: ملاحظاتي

source: Instructor
ar: موجّه المساق

source: Public
ar: عام

source: Search
ar: بحث

source: Users
ar: المستخدمون

source: Text
ar: النص

source: Video
ar: مقطع فيديو

source: Edit
ar: تعديل

source: Available %s
ar: %s متاح

source: This is the list of available %s. You may choose some by selecting them in the box below and then clicking the "Choose" arrow between the two boxes.
ar: هذه قائمة بالـ %s المتاحة. تستطيع اختيار البعض عن طريق انتقائهم في المربع أدناه ومن ثم الضغط على سهم "اختيار" الموجود بين المربعين.

source: Type into this box to filter down the list of available %s.
ar: اطبع داخل هذا المربع لتقليل الخيارات في قائمة الـ %s المتاحة.

source: Filter
ar: تقليل خيارات البحث

source: Choose all
ar: اختيار الكل

source: Click to choose all %s at once.
ar: إضغط لاختيار جميع الـ %s في نفس الوقت

source: Choose
ar: اختيار

source: Remove
ar: حذف

source: Chosen %s
ar: الـ %s المختارة

source: This is the list of chosen %s. You may remove some by selecting them in the box below and then clicking the "Remove" arrow between the two boxes.
ar: هذه قائمة بالـ %s المختارة. تستطيع حذف البعض عن طريق انتقائهم في المربع أدناه ومن ثم الضغط على سهم "حذف" الموجود بين المربعين.

source: Remove all
ar: حذف الكل

source: Click to remove all chosen %s at once.
ar: إضغط لحذف جميع الـ %s المختارة في نفس الوقت.

source: %(sel)s of %(cnt)s selected
ar: %(sel)s من %(cnt)s تم تحديدها

source: You have unsaved changes on individual editable fields. If you run an action, your unsaved changes will be lost.
ar: لديك بعض التغييرات التي لم يتم حفظها على حقول فردية قابلة للتعديل. إذا قمت بتشغيل أي إجراء، ستلغى كافة التغييرات التي لم يتم حفظها.

source: You have selected an action, but you haven't saved your changes to individual fields yet. Please click OK to save. You'll need to re-run the action.
ar: لقد قمت باختيار إجراء، إلا أنك لم تقم بحفظ التغييرات التي قمت بها على الحقول الفردية حتى الآن. الرجاء الضغط على OK للحفظ. ستحتاج إلى إعادة ذلك الإجراء مرة أخرى.

source: You have selected an action, and you haven't made any changes on individual fields. You're probably looking for the Go button rather than the Save button.
ar: لقد قمت باختيار إجراء، إلا أنك لم تقم بأي تغييرات على الحقول الفردية. على الأرجح أنك تبحث على زر GO عوضاً عن زر الحفظ.

source: January|February|March|April|May|June|July|August|September|October|November|December
ar: يناير|فبراير|مارس|أبريل|مايو|يونيو|يوليو|أغسطس|سبتمبر|أكتوبر|نوفمبر|ديسمبر

source: S|M|T|W|T|F|S
ar: الأحد|الإثنين|الثلاثاء|الأربعاء|الخميس|الجمعة|السبت

source: Show
ar: إظهار

source: Hide
ar: إخفاء

source: Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday
ar: الأحد|الإثنين|الثلاثاء|الأربعاء|الخميس|الجمعة|السبت

source: Now
ar: الآن

source: Clock
ar: الساعة

source: Choose a time
ar: اختر وقتاً

source: Midnight
ar: منتصف الليل

source: 6 a.m.
ar: 6 صباحاً

source: Noon
ar: الظهر

source: Today
ar: اليوم

source: Calendar
ar: التقويم

source: Yesterday
ar: أمس

source: Tomorrow
ar: غداً

source: Open Calculator
ar: فتح الآلة الحاسبة

source: Close Calculator
ar: إغلاق الآلة الحاسبة

source: Preview
ar: المعاينة

source: Post body
ar: محتوى المشاركة

source: Error fetching distribution.
ar: حدث خطأ في عملية استرجاع التوزيع.

source: Unavailable metric display.
ar: العرض المتري غير متوفر.

source: Error fetching grade distributions.
ar: حدث خطأ في عملية استرجاع توزيع الدرجات.

source: Last Updated: <%= timestamp %>
ar: التحديث الأخير: <%= timestamp %>

source: <%= num_students %> students scored.
ar: تم تقييم أعمال <%= num_students %> طالب.

source: Loading...
ar: جاري التحميل...

source: Error getting student list.
ar: خطأ في الحصول على قائمة الطلاب.

source: Error retrieving grading configuration.
ar: خطأ في استرجاع الإعدادات الخاصة بالتقييم.

source: Error generating grades. Please try again.
ar: خطأ في عملية حساب وإعداد الدرجات. الرجاء إعادة المحاولة.

source: File Name
ar: اسم الملف

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
ar: يتم إنشاء الروابط عند الطلب وينتهي مفعولها خلال 5 دقائق نظراً لحساسية المحتوى المتعلق بمعلومات الطالب.

source: Username
ar: اسم المستخدم

source: Email
ar: البريد الإلكتروني

source: Revoke access
ar: إلغاء إمكانية الوصول

source: Enter username or email
ar: أدخل اسم المستخدم أو البريد الإكتروني

source: Please enter a username or email.
ar: الرجاء إدخال اسم مستخدم او عنوان بريد إلكتروني.

source: Error fetching list for role
ar: خطأ في محاولة استرجاع القائمة الخاصة بالأدوار

source: Error changing user's permissions.
ar: خطأ في تغيير صلاحيات المستخدم.

source: Could not find a user with username or email address '<%= identifier %>'.
ar: لا يمكن إيجاد مستخدم بالاسم او عنوان البريد إلكتروني التالي '<%= identifier %>'.

source: Error: User '<%= username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
ar: خطأ: المستخدم '<%= username %>' لم يقم بتفعل حسابه بعد. المستخدمون يجب أن ينشئوا و يفعلوا حساباتهم قبل أن يمكن إسناد الأدوار إليهم

source: Error: You cannot remove yourself from the Instructor group!
ar: خطأ: لا يمكنك حذف نفسك من مجموعة المعلم!

source: Error adding/removing users as beta testers.
ar: حدث خطأ في عملية إضافة/إلغاء مستخدمين كأعضاء في فريق اختبار بيتا.

source: These users were successfully added as beta testers:
ar: تم بنجاح إضافة هؤلاء المستخدمين إلى قائمة أعضاء فريق اختبار بيتا:

source: These users were successfully removed as beta testers:
ar: تم بنجاح إلغاء هؤلاء المستخدمين من قائمة أعضاء فريق اختبار بيتا:

source: These users were not added as beta testers:
ar: لم تتم إضافة هؤلاء المستخدمين إلى قائمة أعضاء فريق اختبار بيتا:

source: These users were not removed as beta testers:
ar: لم يتم إلغاء هؤلاء المستخدمين من قائمة أعضاء فريق اختبار بيتا:

source: Users must create and activate their account before they can be promoted to beta tester.
ar: يتعين على المستخدمين إنشاء وتفعيل حسابهم قبل أن يمكن ترقيتهم لعضو فريق اختبار بيتا.

source: Could not find users associated with the following identifiers:
ar: لم يتم إيجاد مستخدمين لديهم الأرقام لتالية:

source: Error enrolling/unenrolling users.
ar: حدث خطأ في عملية تسجيل/إلغاء تسجيل المستخدمين.

source: The following email addresses and/or usernames are invalid:
ar: عناوين البريد الإلكتروني و/أو الأسماء التالية غير صحيحة:

source: Successfully enrolled and sent email to the following users:
ar: تم بنجاح تسجيل وإرسال بريد إلكتروني إلى المستخدمين التالية أسماؤهم:

source: Successfully enrolled the following users:
ar: تم بنجاح تسجيل المستخدمين التالية أسماؤهم:

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
ar: تم بنجاح إرسال بريد إلكتروني حول التسجيل إلى المستخدمين التالية أسماؤهم. وسيسمح لهم بالالتحاق بالمساق بمجرد قيامهم بالتسجيل:

source: These users will be allowed to enroll once they register:
ar: سيسمح للمستخدمين التالية أسماؤهم بالالتحاق بالمساق بمجرد قيامهم بالتسجيل:

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
ar: تم بنجاح إرسال بريد إلكتروني حول التسجيل إلى المستخدمين التالية أسماؤهم. وسيتم إلحاقهم بالمساق بمجرد قيامهم بالتسجيل:

source: These users will be enrolled once they register:
ar: سيتم إلحاق المستخدمين التالية أسماؤهم بالمساق بمجرد قيامهم بالتسجيل:

source: Emails successfully sent. The following users are no longer enrolled in the course:
ar: تم إرسال الرسائل الإلكترونية بنجاح. ولم يعد المستخدمون التالية أسماؤهم مسجّلون بالمساق:

source: The following users are no longer enrolled in the course:
ar: لم يعد المستخدمون التالية أسماؤهم مسجّلون بالمساق:

source: These users were not affiliated with the course so could not be unenrolled:
ar: لم يكن المستخدمون المذكورون لاحقاً منتسبين للمساق ولذلك فلا يمكن إلغاء تسجيلهم فيه:

source: Your message must have a subject.
ar: ينبغي ملء خانة الموضوع لرسالة البريد الإلكتروني الخاصة بك.

source: Your message cannot be blank.
ar: ينبغي لرسالة البريد الإلكتروني الخاصة بك أن تتضمن محتوى.

source: Your email was successfully queued for sending.
ar: تم بنجاح إدراج رسالتك ضمن صف الرسائل بانتظار إرسالها.

source: You are about to send an email titled '<%= subject %>' to yourself. Is this OK?
ar: أنت بصدد إرسال رسالة بريد إلكتروني إلى نفسك عنوانها '<%= subject %>'. هل هذا ما تريد فعله؟

source: You are about to send an email titled '<%= subject %>' to everyone who is staff or instructor on this course. Is this OK?
ar: أنت بصدد إرسال بريد إلكتروني عنوانه ’<%= subject %>‘ إلى جميع الأشخاص المسجلين ضمن فريق العمل أو التدريس في هذا المساق. هل هذا ما تريد فعله؟

source: You are about to send an email titled '<%= subject %>' to ALL (everyone who is enrolled in this course as student, staff, or instructor). Is this OK?
ar: أنت بصدد إرسال بريد إلكتروني عنوانه ’<%= subject %>‘ إلى الجميع (كافة الأشخاص المسجلين كطلاب أو ضمن فريق العمل أو التدريس في هذا المساق). هل هذا ما تريد فعله؟

source: Your email was successfully queued for sending. Please note that for large classes, it may take up to an hour (or more, if other courses are simultaneously sending email) to send all emails.
ar: تم بنجاح إدراج رسالتك ضمن صف الرسائل بانتظار إرسالها. الرجاء أخذ العلم بأنه في حالة الصفوف الكبيرة، قد يستغرق إرسال كافة الرسائل الإلكترونية ما يصل إلى الساعة (أو أكثر، في حال كانت المساقات الأخرى تقوم بإرسال رسائل إلكترونية بالتزامن مع هذا المساق).

source: Error sending email.
ar: خطأ في إرسال البريد الإلكتروني.

source: There is no email history for this course.
ar: لا يوجد سجل خاص بالرسائل البريدية المرسلة لهذا المساق.

source: There was an error obtaining email task history for this course.
ar: حدث خطأ أثناء محاولة الحصول على سجل عن المهمات المتعلّقة بالرسائل البريدية الخاصة بهذا المساق.

source: Please enter a student email address or username.
ar: الرجاء إدخال اسم المستخدم للطالب أو عنوان بريده الإلكتروني.

source: Error getting student progress url for '<%= student_id %>'. Make sure that the student identifier is spelled correctly.
ar: ثمّة خطأ في الحصول على الرابط الإلكتروني لسجل تقدُّم الطالب الذي يحمل الرقم ’<%= student_id %>‘. الرجاء التحقّق من إدخال رقم الطالب بالشكل الصحيح.

source: Please enter a problem location.
ar: الرجاء إدخال الموقع الخاص بالمسألة.

source: Success! Problem attempts reset for problem '<%= problem_id %>' and student '<%= student_id %>'.
ar: تم بنجاح! إعادة ضبط عدد المحاولات إلى الصفر بالنسبة للمسألة رقم '<%= problem_id %>' وللطالب رقم '<%= student_id %>'.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ar: حدث خطأ في إعادة ضبط عدد المحاولات إلى الصفر بالنسبة للمسألة رقم '<%= problem_id %>' وللطالب رقم '<%= student_id %>'. يجب التحقق من إدخال رقم الطالب ورقم المسألة بالكامل وبالشكل الصحيح.

source: Delete student '<%= student_id %>'s state on problem '<%= problem_id %>'?
ar: إلغاء حالة الطالب رقم '<%= student_id %>' بالنسبة للمسألة رقم '<%= problem_id %>'؟

source: Error deleting student '<%= student_id %>'s state on problem '<%= problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
ar: حدث خطأ في إلغاء حالة الطالب رقم '<%= student_id %>' بالنسبة للمسألة رقم '<%= problem_id %>'. يجب التحقق من إدخال رقم الطالب ورقم المسألة بالكامل وبالشكل الصحيح.

source: Module state successfully deleted.
ar: تم بنجاح إلغاء حالة الوحدة التعليمية.

source: Started rescore problem task for problem '<%= problem_id %>' and student '<%= student_id %>'. Click the 'Show Background Task History for Student' button to see the status of the task.
ar: تم البدء بمهمة إعادة تقييم المسألة بالنسبة للمسألة رقم '<%= problem_id %>' وللطالب رقم '<%= student_id %>'. يمكن الضغط على زر ’إظهار سجل المهمات السابقة للطالب‘ للاطلاع على حالة المهمة.

source: Error starting a task to rescore problem '<%= problem_id %>' for student '<%= student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
ar: حدث خطأ في البدء بمهمة إعادة تقييم المسألة بالنسبة للمسألة رقم '<%= problem_id %>' وللطالب رقم '<%= student_id %>'. يجب التحقق من إدخال رقم الطالب ورقم المسألة بالكامل وبالشكل الصحيح.

source: Error getting task history for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
ar: حدث خطأ في الحصول على سجل المهمات السابقة بالنسبة للمسألة رقم '<%= problem_id %>' وللطالب رقم '<%= student_id %>'. يجب التحقق من إدخال رقم الطالب ورقم المسألة بالكامل وبالشكل الصحيح.

source: Reset attempts for all students on problem '<%= problem_id %>'?
ar: إعادة ضبط عدد المحاولات إلى الصفر بالنسبة لكافة الطلاب على المسألة رقم '<%= problem_id %>'؟

source: Successfully started task to reset attempts for problem '<%= problem_id %>'. Click the 'Show Background Task History for Problem' button to see the status of the task.
ar: تم بنجاح البدء بمهمة إعادة ضبط عدد المحاولات إلى الصفر بالنسبة للمسألة رقم '<%= problem_id %>'. يمكن الضغط على زر ’إظهار سجل المهمات السابقة المتعلقة بالمسألة‘ للاطلاع على حالة المهمة.

source: Error starting a task to reset attempts for all students on problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
ar: حدث خطأ لدى البدء بمهمة إعادة ضبط عدد المحاولات إلى الصفر لكافة الطلاب بالنسبة للمسألة رقم '<%= problem_id %>'. يجب التحقق من إدخال رقم المسألة بالكامل وبالشكل الصحيح.

source: Rescore problem '<%= problem_id %>' for all students?
ar: إعادة تقييم المسألة رقم '<%= problem_id %>' لكافة الطلاب؟

source: Successfully started task to rescore problem '<%= problem_id %>' for all students. Click the 'Show Background Task History for Problem' button to see the status of the task.
ar: تم بنجاح البدء بمهمة إعادة تقييم المسألة رقم '<%= problem_id %>' لكافة الطلاب. يمكن الضغط على زر ’إظهار سجل المهمات السابقة المتعلقة بالمسألة‘ للاطلاع على حالة المهمة.

source: Error starting a task to rescore problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
ar: حدث خطأ لدى البدء بمهمة إعادة تقييم المسألة رقم '<%= problem_id %>'. يجب التحقق من الإدخال الصحيح والكامل لرقم المسألة.

source: Error listing task history for this student and problem.
ar: حدث خطأ في عملية إعداد قائمة المهمات السابقة لهذا الطالب وهذه المسألة.

source: Task Type
ar: نوع المهمة

source: Task inputs
ar: مدخلات المهمة

source: Task ID
ar: رمز المهمة

source: Requester
ar: مقدم الطلب

source: Submitted
ar: تم تقديمه

source: Duration (sec)
ar: المدة المستغرقة (sec)

source: State
ar: الحالة

source: Task Status
ar: حالة المهمّة

source: Task Progress
ar: تطوّر المهمة

source: Grades saved. Fetching the next submission to grade.
ar: تم حفظ الدرجات. يجري الآن جلب عملية التقديم التالية حتى يتم تقييمها.

source: Problem Name
ar: اسم المسألة

source: Graded
ar: تم التقييم

source: Available to Grade
ar: متاح لإجراء عملية التقييم.

source: Required
ar: مطلوب

source: Progress
ar: التقدم المحرز

source: Back to problem list
ar: العودة إلى القائمة الخاصة بالمسألة

source: Try loading again
ar: حاول إعادة التحميل

source: <%= num %> available
ar: <%= num %> متوفرة
