Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/django-studio.po
Languages: ar

source: Invalid course update id.
ar: رقم التعريف الخاص بتحديث المساق غير صحيح.

source: Course update not found.
ar: تحديث المساق غير موجود.

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
ar: دليل GIT_REPO_EXPORT_DIR غير محدّد أو أن المسار {0} غير موجود، الرجاء إنشاؤه، أو تجهيز مسار آخر بدليل GIT_REPO_EXPORT_DIR

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
ar: لا يمكن الكتابة على git الذي يدلّ عليه الرابط الإلكتروني، بل يجب أن يكون على شاكلة: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
ar: في حال استخدام روابط الكترونية وفق بروتوكول http، يجب تقديم اسم المستخدم وكلمة المرور ضمن الرابط، على نحوٍ يشبه https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
ar: لا يمكن تحديد الفرع، المستودع في وضعية الرأس غير المتّصل.

source: Unable to update or clone git repository.
ar: لا يمكن تحديث أو استنساخ مستودع git.

source: Unable to export course to xml.
ar: لا يمكن تصدير المساق إلى ملف بصيغة xml.

source: Unable to configure git username and password
ar: لا يمكن تهيئة اسم المستخدم وكلمة المرور لـ git

source: Unable to commit changes. This is usually because there are no changes to be committed
ar: لا يمكن إلزام التغييرات. ويحدث ذلك عادةً بسبب عدم وجود تغييرات يجب إلزامها

source: Unable to push changes. This is usually because the remote repository cannot be contacted
ar: لا يمكن دفع التغييرات إلى المستودع. يحدث ذلك عادةً بسبب عدم القدرة على الاتصال بالمستودع البعيد

source: Bad course location provided
ar: موقع المساق الذي تم تقديمه غير صحيح

source: Missing branch on fresh clone
ar: يوجد فرع ناقص على النسخة الجديدة

source: Command was: {0!r}. Working directory was: {1!r}
ar: كان الأمر المستخدم: {0!r}. ومجلّد الملفات المستخدم: {1!r}

source: Command output was: {0!r}
ar: كانت مخرجات الأمر: {0!r}

source: Directory already exists, doing a git reset and pull instead of git clone.
ar: المجلد موجود بالفعل، سيتم القيام بعملية إعادة ضبط أو سحب للـ git بدلاً من استنساخ git.

source: My Notes
ar: ملاحظاتي

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
ar: قم بأخذ المساق المحدّد وحاول تصديره إلى مستودع git . يجب أن يكون المجلّد الخاص بالمساق هو أصلاً مستودع git. الاستخدام: git_export <course_loc> <git_url>

source: Upload completed
ar: تم الانتهاء من عملية التحميل

source: Video
ar: مقطع فيديو

source: Blank
ar: صفحة فارغة

source: Special characters not allowed in organization, course number, and course run.
ar: لا يسمح باستخدام الحروف الخاصة ضمن اسم المؤسسة، ورقم المساق، ورقم تشغيله.

source: There is already a course defined with the same organization, course number, and course run. Please change either organization or course number to be unique.
ar: يوجد بالفعل مساق معرّف مسبقاً بنفس اسم المؤسسة ورقم المساق وتشغيله. الرجاء تغيير إما اسم المؤسسة أو رقم المساق ليكون متميزاً.

source: Please change either the organization or course number so that it is unique.
ar: الرجاء تغيير إما اسم المؤسسة أو رقم المساق ليكون متميزاً.

source: Unable to create course '{name}'. {err}
ar: غير قادر على إنشاء المساق '{name}'. {err}

source: Course successfully exported to git repository
ar: تم بنجاح تصدير المساق إلى مستودع git

source: We only support uploading a .tar.gz file.
ar: ندعم فقط تحميل ملفات بصيغة .tar.gz

source: File upload corrupted. Please try again
ar: حدث خطأ في تحميل الملف. الرجاء إعادة المحاولة

source: Could not find the course.xml file in the package.
ar: لم نتمكن من إيجاد الملف course.xml في الحزمة.

source: Duplicate of {0}
ar: نسخة مطابقة عن {0}

source: Duplicate of '{0}'
ar: نسخة مطابقة لـ '{0}'

source: Incoming video data is empty.
ar: بيانات لمقطع الفيديو الوارد فارغة.

source: Can't find item by locator.
ar: لا يمكن إيجاد العنصر باستخدام مُحدّد الموقع.

source: Transcripts are supported only for "video" modules.
ar: يتوفّر الدّعم للنصوص فقط في حالة الوحدات الدراسية التي تتألف من "مقاطع فيديو".

source: Insufficient permissions
ar: صلاحيات غير كافية

source: Could not find user by email address '{email}'.
ar: لا يوجد مستخدم بالبريد الإلكتروني '{email}'.

source: User {email} has registered but has not yet activated his/her account.
ar: المستخدم {email} قام بالتسجيل ولكن لم يقم بعد بتفعيل حسابه.

source: `role` is required
ar: "الدور" مطلوب

source: Only instructors may create other instructors
ar: الموجّهون فقط هم من بإمكانهم إنشاء موجهين آخرين

source: You may not remove the last instructor from a course
ar: لا يمكنك حذف آخر موجّه من مساق

source: unrequested
ar: لم يُطلب

source: pending
ar: معلّق

source: granted
ar: ممنوح

source: denied
ar: مرفوض

source: Studio user
ar: مستخدم نظام استوديو Studio

source: The date when state was last updated
ar: تاريخ آخر تحديث للحالة

source: Current course creator state
ar: الحالة الحالية لصاحب المساق

source: Optional notes about this user (for example, why course creation access was denied)
ar: ملاحظات اختيارية عن هذا المستخدم (مثلاً، لماذا تم رفض طلب الدخول لإنشاء مساق)
