Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/djangojs-partial.po
Languages: ar

source: <%= num %> graded
ar: تم تقييم <%= num %>

source: <%= num %> more needed to start ML
ar: يلزم <%= num %> إضافية للبدء بـ ML

source: Re-check for submissions
ar: إعادة التحقق من وجود تقديمات أخرى

source: System got into invalid state: <%= state %>
ar: دخل النظام في حالة غير صحيحة: <%= state %>

source: System got into invalid state for submission:
ar: دخل النظام في حالة غير صحيحة بالنسبة لعملية التقديم:

source: (Hide)
ar: (إخفاء)

source: (Show)
ar: (إظهار)

source: Insert Hyperlink
ar: إدخال رابط إلكتروني

source: "optional title"
ar: "عنوان اختياري"

source: Insert Image (upload file or type url)
ar: إدخال صورة (تحميل ملف أو طباعة الرابط الإلكتروني url)

source: Markdown Editing Help
ar: للمساعدة في التحرير بلغة المارك داون

source: Bold (Ctrl+B)
ar: سميك (Ctrl+B)

source: Italic (Ctrl+I)
ar: مائل (Ctrl+I)

source: Hyperlink (Ctrl+L)
ar: رابط إلكتروني (Ctrl+L)

source: Blockquote (Ctrl+Q)
ar: نص مقتبس (Ctrl+Q)

source: Code Sample (Ctrl+K)
ar: نموذج تعليمات برمجية (Ctrl+K)

source: Image (Ctrl+G)
ar: صورة (Ctrl+G)

source: Numbered List (Ctrl+O)
ar: قائمة مرقّمة (Ctrl+O)

source: Bulleted List (Ctrl+U)
ar: قائمة منقّطة (Ctrl+U)

source: Heading (Ctrl+H)
ar: عنوان (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
ar: خط أفقي (Ctrl+R)

source: Undo (Ctrl+Z)
ar: إلغاء (Ctrl+Z)

source: Redo (Ctrl+Y)
ar: إعادة الفعل (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
ar: إعادة الفعل (Ctrl+Shift+Z)

source: strong text
ar: نص بأحرف قوية

source: emphasized text
ar: نص بأحرف مائلة للتشديد

source: enter image description here
ar: أدخل الوصف الخاص بالصورة هنا

source: enter link description here
ar: أدخل الوصف الخاص بالرابط هنا

source: Blockquote
ar: نص مقتبس

source: enter code here
ar: أدخل التعليمات البرمجية هنا

source: List item
ar: أحد عناصر القائمة

source: Heading
ar: عنوان

source: Unknown Error Occurred.
ar: حدث خطأ ما.

source: Successfully reset the attempts for user {user}
ar: تم إعادة ضبط محاولات المستخدم {user} بنجاح

source: Failed to reset attempts.
ar: لم تنجح عمليات ضبط المحاولات.

source: Successfully deleted student state for user {user}
ar: تم حذف حالة المستخدم {user} بنجاح

source: Failed to delete student state.
ar: لم تنجح عملية حذف حالة الطالب.

source: Successfully rescored problem for user {user}
ar: تمت عمليات إعادة تقييم المستخدم {user} بنجاح

source: Failed to rescore problem.
ar: لم تتم عملية إعادة التقييم بنجاح

source: Unable to retrieve data, please try again later.
ar: لا يمكن استرجاع البيانات، الرجاء إعادة المحاولة لاحقاً

source: student(s) opened Subsection
ar: قام الطالب (الطلاب) بفتح القسم الفرعي

source: students
ar: الطلاب

source: questions
ar: الأسئلة

source: Number of Students
ar: عدد الطلاب
