Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/django-partial.po
Languages: ar

source: Time you want the video to start if you don't want the entire video to play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ar: الوقت الذي تريد عنده أن يبدأ مقطع الفيديو، في حال لم تكن ترغب في تشغيل كامل الفيديو. يُحدَّد الوقت على الشكل HH:MM:SS. والحد الأقصى للقيمة 23:59:59.

source: Video Start Time
ar: وقت بدء تشغيل مقطع الفيديو

source: Time you want the video to stop if you don't want the entire video to play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
ar: الوقت الذي تريد عنده أن يتوقّف مقطع الفيديو في حال لم ترغب في تشغيل كامل الفيديو. يُحدَّد الوقت على الشكل HH:MM:SS. والحد الأقصى للقيمة 23:59:59.

source: Video Stop Time
ar: وقت توقُّف مقطع الفيديو

source: The external URL to download the video.
ar: الرابط الإلكتروني الخارجي لتنزيل مقطع الفيديو.

source: Download Video
ar: تنزيل مقطع الفيديو

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
ar: السماح للطلاب بتنزيل نسخ من هذا الفيديو بصيغ مختلفة في حال لم يتمكّنوا من استخدام مشغل فيديو edX أو كانوا لا يستطيعون استخدام يوتيوب. يجب إضافة رابط إلكتروني واحد على الأقل عدا عن يوتيوب في حقل الروابط الإلكترونية لملف الفيديو.

source: Video Download Allowed
ar: يُسمح بتنزيل الملفّات

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
ar: الرابط الإلكتروني أو الروابط الإلكترونية حيث قمت بنشر نسخ من الفيديو من غير يوتيوب. يجب أن ينتهي كل رابط إلكتروني بلاحقة .mpeg أو .mp4 أو .ogg أو .webm وينبغي أن لا يكون الرابط الإلكتروني من يوتيوب.(للتوافق مع متصفح الانترنت ننصح أن يكون بصيغة .mp4 أو .webm ) سيكون الطلاب قادرين على عرض أول مقطع فيديو في القائمة يتوافق مع جهاز الكمبيوتر الخاص بهم. للسماح للطلاب بتنزيل مقاطع الفيديو هذه، اضبط خاصية "السماح بتنزيل الفيديو" على "صحيح".

source: Video File URLs
ar: الروابط الإلكترونية لملف الفيديو

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
ar: يمكن للطلاب في الأساس تنزيل نص بلاحقة .srt أو .txt عندما تقوم بضبط إعداد "السماح بتنزيل النص" على "صحيح". وفي حال رغبت في توفير نص ممكن تتزيله بصيغة مختلفة، ننصحك بتحميل ورقة موزّعة باستخدام حقل "تحميل ورقة موزّعة". إذا لم يكن ذلك ممكناً، يمكنك نشر ملف للنص في صفحة "الملفات والتحميل" أو على الإنترنت، ومن ثمّ إضافة الرابط الإلكتروني للنص هنا. سيرى الطلاب رابط لتنزيل ذلك النص تحت مقطع الفيديو.

source: Downloadable Transcript URL
ar: الرابط الإلكتروني للنص القابل للتنزيل

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
ar: السماح للطلاب بتنزيل النص محدّد التوقيت. يظهر رابط لتنزيل الملف تحت مقطع الفيديو. في الأساس، يكون النص في ملف يحمل لاحقة .srt أو .txt. في حال أردت إتاحة تنزيل النص بصيغة مختلفة، الرجاء تحميل الملف باستخدام حقل "تحميل ورقة موزّعة".

source: Download Transcript Allowed
ar: يُسمح بتنزيل النص

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
ar: النص الأساسي لمقطع الفيديو، من حقل "النص الأساسي محدد التوقيت" في التبويب "أساسي". يجب أن يكون هذا النص باللغة الإنكليزية. ليس عليك تغيير هذا الإعداد.

source: Default Timed Transcript
ar: النص الأساسي محدّد التوقيت

source: Specify whether the transcripts appear with the video by default.
ar: تحديد ما إذا كانت النصوص تظهر في الأساس مع مقطع الفيديو.

source: Show Transcript
ar: عرض النص

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
ar: إضافة نصوص بلغاتٍ مختلفة. الرجاء النقر أدناه لتحديد لغة معينة وتحميل ملف نص من نوع .srt لتلك اللغة.

source: Transcript Languages
ar: لغات النص

source: Preferred language for transcript.
ar: اللغة المفضّلة للنص

source: Preferred language for transcript
ar: اللغة المفضّلة للنص

source: Transcript file format to download by user.
ar: صيغة ملف النص التي سيقوم المستخدم بتنزيلها.

source: SubRip (.srt) file
ar: ملفّ SubRip (.srt)

source: Text (.txt) file
ar: ملف نصّي (.txt)

source: The last speed that the user specified for the video.
ar: السرعة الأخيرة التي حدّدها المستخدم لمقطع الفيديو.

source: The default speed for the video.
ar: السرعة الأساسية لمقطع الفيديو.

source: Specify whether YouTube is available for the user.
ar: تحديد ما إذا كان يوتيوب متاحاً للمستخدم.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
ar: تحميل ورقة موزّعة تترافق مع هذا الفيديو. يمكن للطلاب تنزيل الورقة الموزّعة بالنقر على رابط "تنزيل ورقة موزّعة" تحت مقطع الفيديو.

source: Upload Handout
ar: تحميل ورقة موزّعة

source: Navigation
ar: التصفّح

source: About these documents
ar: نبذة عن هذه الوثائق

source: Index
ar: فهرس

source: Search
ar: بحث

source: Copyright
ar: حقوق الطبع والنشر

source: Name
ar: الاسم

source: Username
ar: اسم المستخدم

source: Grade
ar: الدرجة

source: Percent
ar: النسبة

source: Section
ar: القسم

source: Subsection
ar: القسم الفرعي

source: Opened by this number of students
ar: تم فتحه من قبل هذا العدد من الطلاب

source: subsections
ar: أقسام فرعية

source: Count of Students
ar: عدد الطلاب

source: Percent of Students
ar: نسبة الطلاب

source: Score
ar: النتيجة

source: problems
ar: المسائل

source: This is the wiki for **{organization}**'s _{course_name}_.
ar: هذه هي الويكي الخاصة بالمساق _{course_name}_ الخاص بـ**{organization}**.

source: Course page automatically created.
ar: تم إنشاء صفحة المساق بشكلٍ تلقائي.

source: Welcome to the edX Wiki
ar: أهلاً بك في الويكي الخاصة بـedX

source: Visit a course wiki to add an article.
ar: قم بزيارة الويكي الخاصة بمساق من أجل إضافة مقال.

source: Invalid course id.
ar: رقم تعريف المساق غير صحيح

source: Invalid location.
ar: موقع غير صحيح.

source: User {username} does not exist.
ar: المستخدم {username} غير موجود.

source: User {username} has never accessed problem {location}
ar: لم يقم المستخدم {username} أبداً بفتح المسألة {location}.

source: ERROR: No playable video sources found!
ar: خطأ: لم يتم إيجاد مصدر للفيديو يمكن تشغيله!

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
ar: المسار {0} غير موجود، الرجاء إنشاؤه، أو تكوين مسار مختلف باستخدام GIT_REPO_DIR

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
ar: عنوان المصدر الإلكتروني URL الذي تم تقديمه للـ Git لا يمكن استخدامه، يجب أن يكون العنوان على نحو يشبه: git@github.com:mitocw/edx4edx_lite.git

source: Unable to get git log
ar: لا يمكن الحصول على سجل التغييرات الخاص بـ GIT

source: git clone or pull failed!
ar: لم تنجح عملية الاستنساخ أو الجلب باستخدام نظام إدارة النسخ البرمجية GIT

source: Unable to run import command.
ar: لا يمكن إجراء عملية استيراد الملفات

source: The underlying module store does not support import.
ar: لا يدعم مستودع الوحدات الأساسي عملية استيراد الملفات.

source: The specified remote branch is not available.
ar: الفرع الخارجي المحدّد غير موجود.

source: Unable to switch to specified branch. Please check your branch name.
ar: لا يمكن التغيير إلى الفرع المحدّد. الرجاء التأكد من اسم الفرع.

source: Failed in authenticating {0}, error {1}
ar: فشلت عملية مصادقة {0}، خطأ {1}

source: Failed in authenticating {0}
ar: فشلت عملية مصادقة {0}

source: fixed password
ar: كلمة سر ثابتة

source: All ok!
ar: كل شئ على ما يرام!

source: Must provide username
ar: يجب إدخال اسم المستخدم

source: Must provide full name
ar: يجب إدخال الاسم بالكامل

source: email must end in
ar: يجب أن ينتهي البريد الإلكتروني بـ

source: Failed - email {0} already exists as external_id
ar: فشلت العملية - البريد الإلكتروني {0} موجود سابقاً كمعرِّف خارجي

source: Password must be supplied if not using certificates
ar: يجب إدخال كلمة السر في حال عدم وجود شهادات [مصادقة]

source: email address required (not username)
ar: البريد الإلكتروني مطلوب (وليس اسم المستخدم)

source: Oops, failed to create user {0}, IntegrityError
ar: عفواً، فشلت عملية إنشاء المستخدم {0}، خطأ تكامل

source: User {0} created successfully!
ar: تم إنشاء المستخدم {0} بنجاح!

source: Cannot find user with email address {0}
ar: لا يوجد مستخدم بالبريد الالكتروني {0}

source: Cannot find user with username {0} - {1}
ar: لا يوجد مستخدم له اسم المستخدم {0} - {1}

source: Deleted user {0}
ar: هذا المستخدم محذوف

source: Statistic
ar: إحصائية

source: Value
ar: قيمة

source: Site statistics
ar: إحصائيات الموقع

source: Total number of users
ar: العدد الإجمالي للمستخدمين

source: Courses loaded in the modulestore
ar: تم تحميل المساقات في مجمع الوحدات

source: username
ar: اسم المستخدم

source: email
ar: بريد إلكتروني

source: Repair Results
ar: نتائج الإصلاح

source: Create User Results
ar: أنشئ نتائج المستخدم

source: Delete User Results
ar: احذف نتائج المستخدم

source: The git repo location should end with '.git', and be a valid url
ar: موقع حاضنة git يجب أن ينتهي باللاحقة "git." وأن يكون عنواناً لرابط إلكتروني صالح

source: Added Course
ar: مساق مضاف

source: Refusing to import. GIT_IMPORT_WITH_XMLMODULESTORE is not turned on, and it is generally not safe to import into an XMLModuleStore with multithreaded. We recommend you enable the MongoDB based module store instead, unless this is a development environment.
ar: تم رفض الاستيراد. فالوحدة GIT_IMPORT_WITH_XMLMODULESTORE ليست قيد التشغيل، ولا تعد عملية الاستيراد إلى XMLModuleStore متعدد المسالك عملية آمنة. نوصي بتمكين الوحدة المرتكزة على MongoDB كإجراء بديل، ما لم تكن هذه بيئة تطوير

source: The course {0} already exists in the data directory! (reloading anyway)
ar: المساق {0} موجود مسبقاً في دليل البيانات! (جاري إعادة التحميل على أي حال)

source: Unable to clone or pull repository. Please check your url. Output was: {0!r}
ar: لا يمكن استنساخ أو سحب المستودع. الرجاء التأكد من الرابط الإلكتروني. المُخرج الذي تلقّيناه كان: {0!r}

source: Failed to clone repository to {0}
ar: فشلت عملية استنساخ الحاضنة إلى {0}

source: Successfully switched to branch: {branch_name}
ar: تم التغيير بنجاح إلى الفرع: {branch_name}

source: Loaded course {0} {1}<br/>Errors:
ar: المساق المحمل {0} {1}<br/>أخطاء:

source: Course Name
ar: اسم المساق

source: Directory/ID
ar: الدليل/بطاقة التعريف

source: Git Commit
ar: إيداع Git

source: Last Change
ar: التغيير الأخير

source: Last Editor
ar: المحرر الأخير

source: Information about all courses
ar: معلومات عن جميع المساقات

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
ar: خطأ - لا يمكن الوصول إلى المساق المرتبط برقم التعريف {0}<br/><pre>{1}</pre>

source: Deleted
ar: محذوف

source: course_id
ar: رقم تعريف المساق

source: # enrolled
ar: # مسجل

source: # staff
ar: # موظفين

source: instructors
ar: المشرفون

source: Enrollment information for all courses
ar: معلومات التسجيل لكافة المساقات

source: role
ar: الدور

source: full_name
ar: الاسم الكامل

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
ar: استيراد مستودع ملفات GIT المحدّد والفرع الاختياري إلى مخزن الوحدات والدليل المحدد اختيارياً.

source: Re-open thread
ar: إعادة فتح مسار

source: Close thread
ar: إغلاق مسار

source: Title can't be empty
ar: لا يمكن ترك العنوان فارغاً

source: Body can't be empty
ar: لا يمكن ترك المحتوى فارغاً

source: Comment level too deep
ar: مستوى التعليق أعمق مما يجب

source: allowed file types are '%(file_types)s'
ar: أنواع الملفات المسموحة هي '%(file_types)s'

source: maximum upload file size is %(file_size)sK
ar: الحد الأقصى لحجم الملف القابل للتحميل هو %(file_size)sK.

source: Error uploading file. Please contact the site administrator. Thank you.
ar: خطأ في تحميل الملف. الرجاء الاتصال بالمشرف على الموقع. وشكراً.

source: Good
ar: جيد

source: All Groups
ar: كافة المجموعات

source: User does not exist.
ar: المستخدم غير موجود.

source: Task is already running.
ar: المهمة قيد التشغيل بالفعل.

source: User ID
ar: هوية المستخدم

source: Email
ar: البريد الإلكتروني

source: Language
ar: لغة

source: Location
ar: الموقع

source: Birth Year
ar: سنة الميلاد

source: Gender
ar: الجنس

source: Level of Education
ar: المستوى التعليمي

source: Mailing Address
ar: العنوان البريدي

source: Goals
ar: أهداف

source: Module does not exist.
ar: الوحدة غير موجودة

source: An error occurred while deleting the score.
ar: حدث خطأ أثناء مسح الدرجة

source: Complete
ar: تم استكمال البيانات

source: Incomplete
ar: البيانات غير مستكملة

source: Your grade report is being generated! You can view the status of the generation task in the 'Pending Instructor Tasks' section.
ar: يجري حالياً إعداد تقرير الدرجات الخاص بك! وبإمكانك الاطلاع على حالة مهمة إعداد التقرير في قسم ’المهام غير المستكملة لموجّه المساق‘.

source: A grade report generation task is already in progress. Check the 'Pending Instructor Tasks' table for the status of the task. When completed, the report will be available for download in the table below.
ar: عملية إعداد تقرير الدرجات قد بدأت بالفعل. بإمكانك الاطلاع على حالة مهمة إعداد التقرير في قسم ’المهام غير المستكملة لموجّه المساق‘.

source: Successfully changed due date for student {0} for {1} to {2}
ar: تم بنجاح تغيير التاريخ المحدد للطالب {0} لـ {1} إلى {2}

source: Successfully reset due date for student {0} for {1} to {2}
ar: تم بنجاح إعادة ضبط التاريخ المحدد إلى الوضع الأصلي للطالب {0} لـ {1} إلى {2}

source: Membership
ar: العضوية

source: Student Admin
ar: المشرف الطلابي

source: Extensions
ar: تمديد

source: Data Download
ar: تنزيل البيانات

source: Analytics
ar: التحليلات

source: Course Statistics At A Glance
ar: لمحة سريعة عن الإحصاءات الخاصة بالمساق.

source: Found a single student.
ar: وجد طالب واحد

source: Couldn't find student with that email or username.
ar: الرجاء إدخال اسم الطالب أو عنوان بريده الإلكتروني.

source: List of students enrolled in {course_key}
ar: قائمة بالطلاب المسجّلين في {course_key}

source: Summary Grades of students enrolled in {course_key}
ar: ملخّص درجات الطلاب المسجّلين في المساق {course_key}

source: Raw Grades of students enrolled in {course_key}
ar: الدرجات الأولية للطلاب المسجّلين في المساق {course_key}

source: Failed to create a background task for rescoring "{problem_url}".
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة تقييم المسألة "{problem_url}".

source: Failed to create a background task for rescoring "{problem_url}": problem not found.
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة تقييم المسألة "{problem_url}": لا يمكن إيجاد المسألة.

source: Failed to create a background task for rescoring "{url}": {message}.
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة تقييم "{url}": {message}.

source: Failed to create a background task for resetting "{problem_url}".
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة ضبط إعدادات المسألة "{problem_url}".

source: Failed to create a background task for resetting "{problem_url}": problem not found.
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة ضبط إعدادات المسألة "{problem_url}": لا يمكن إيجاد المسألة.

source: Failed to create a background task for resetting "{url}": {message}.
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة ضبط "{url}": {message}.

source: Could not find problem location "{url}".
ar: لم يتمّ إيجاد موقع المسألة "{url}".

source: Found module.
ar: تم إيجاد الوحدة.

source: Couldn't find module with that urlname: {url}.
ar: لم يتم إيجاد الوحدة باستخدام الرابط الإلكتروني: {url}

source: Deleted student module state for {state}!
ar: حذف حالة وحدة الطالب لـ {state}!

source: Failed to delete module state for {id}/{url}.
ar: لم تنجح عملية حذف حالة الوحدة لـ{id}/{url}.

source: Module state successfully reset!
ar: تمت إعادة ضبط حالة الوحدة بنجاح!

source: Couldn't reset module state for {id}/{url}.
ar: لم تنجح عملية إعادة ضبط حالة الوحدة لـ{id}/{url}.

source: Failed to create a background task for rescoring "{key}" for student {id}.
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة تقييم "{key}" للطالب {id}.

source: Failed to create a background task for rescoring "{key}": {id}.
ar: لم تنجح عملية إنشاء مهمة تُنفَّذ في الخلفية من أجل إعادة تقييم "{key}": {id}.

source: Progress page for username: {username} with email address: {email}
ar: صفحة التقدّم المُحرز الخاصة بالمستخدم: {username} صاحب البريد الإلكتروني: {email}

source: Assignment Name
ar: اسم المهمة المفروضة

source: Please enter an assignment name
ar: الرجاء إدخال اسم للمهمة المفروضة

source: Invalid assignment name '{name}'
ar: اسم غير صحيح للمهمة المفروضة '{name}'

source: External email
ar: بريد إلكتروني خارجي

source: Grades for assignment "{name}"
ar: العلامات الخاصة بالمهمة المفروضة "{name}"

source: List of Staff
ar: قائمة بأعضاء طاقم العمل

source: List of Instructors
ar: قائمة بموجّهي المساق

source: Student profile data for course {course_id}
ar: بيانات الملف الشخصي للطالب للمساق {course_id}

source: Found {num} records to dump.
ar: تم إيجاد {num} سجلاً سيتم التخلص منها.

source: Couldn't find module with that urlname.
ar: لا يمكن إيجاد وحدة تحمل الرابط الإلكتروني المذكور.

source: Student state for problem {problem}
ar: حالة الطالب بالنسبة للمسألة {problem}

source: List of Beta Testers
ar: قائمة فريق اختبار بيتا

source: Your email was successfully queued for sending. Please note that for large classes, it may take up to an hour (or more, if other courses are simultaneously sending email) to send all emails.
ar: تم بنجاح إدراج رسالتك ضمن صف الرسائل بانتظار إرسالها. الرجاء أخذ العلم بأنه في حالة الصفوف الكبيرة، قد يستغرق إرسال كافة الرسائل الإلكترونية ما يصل إلى الساعة (أو أكثر، في حال كانت المساقات الأخرى تقوم بإرسال رسائل إلكترونية بالتزامن مع هذا المساق).

source: Your email was successfully queued for sending.
ar: تم بنجاح إدراج رسالتك ضمن صف الرسائل بانتظار إرسالها.

source: Grades from {course_id}
ar: العلامات من المساق {course_id}

source: No remote gradebook defined in course metadata
ar: لم يتم تحديد دفتر العلامات الخارجي ضمن البيانات التعريفية للمساق

source: No remote gradebook url defined in settings.FEATURES
ar: لم يتم تحديد الرابط الإلكتروني لدفتر العلامات الخارجي ضمن إعدادات المساق settings.FEATURES

source: No gradebook name defined in course remote_gradebook metadata
ar: لم يتم تحديد اسم دفتر العلامات ضمن البيانات التعريفية لـ remote_gradebook للمساق

source: Failed to communicate with gradebook server at {url}
ar: لم تنجح عملية الاتصال بمُخدِّم دفتر العلامات على الرابط {url}

source: Error: {err}
ar: الخطأ: {err}

source: Remote gradebook response for {action}
ar: الرد من دفتر العلامات الخارجي للعملية {action}

source: Full name
ar: الإسم بالكامل

source: Roles
ar: الأدوار

source: List of Forum {name}s in course {id}
ar: قائمة بأسماء المنتديات {name} في المساق {id}

source: Error: unknown rolename "{rolename}"
ar: خطأ: اسم الدور المذكور "{rolename}" غير معروف

source: Error: unknown username "{username}"
ar: خطأ: اسم المستخدم المذكور "{username}" غير معروف

source: Error: user "{username}" does not have rolename "{rolename}", cannot remove
ar: خطأ: المستخدم المذكور "{username}" ليس لديه اسم الدور "{rolename}"، وبالتالي لا يمكن إلغاؤه

source: Removed "{username}" from "{course_id}" forum role = "{rolename}"
ar: تمّ إلغاء المستخدم "{username}" من المساق "{course_id}" ودوره في المنتدى= "{rolename}"

source: Error: user "{username}" already has rolename "{rolename}", cannot add
ar: خطأ: المستخدم "{username}" لديه بالفعل الدور "{rolename}"، وبالتالي لا يمكن إضافته

source: Error: user "{username}" should first be added as staff before adding as a forum administrator, cannot add
ar: خطأ: يجب إضافة المستخدم "{username}" أولاً كمشرف المنتدى قبل إضافته كمشرف على المنتدى، وبالتالي لا يمكن إضافته

source: Added "{username}" to "{course_id}" forum role = "{rolename}"
ar: تمّ إضافة المستخدم "{username}" إلى المساق "{course_id}" ودوره في المنتدى= "{rolename}"

source: {title} in course {course_key}
ar: {title} للمساق {course_key}

source: ID
ar: الرمز التعريفي

source: Full Name
ar: الإسم الكامل

source: edX email
ar: بريد edX الإلكتروني

source: Enrollment of students
ar: تسجيل الطلاب

source: Un-enrollment of students
ar: إلغاء تسجيل الطلاب

source: Failed to find any background tasks for course "{course}", module "{problem}" and student "{student}".
ar: لم يتم إيجاد أي مهام تُنفَّذ في الخلفية للمساق "{course}"، والوحدة "{problem}" والطالب "{student}".

source: Failed to find any background tasks for course "{course}" and module "{problem}".
ar: لم يتم إيجاد أي مهام تُنفَّذ في الخلفية للمساق "{course}"، والوحدة "{problem}".

source: Unable to parse date:
ar: ليس بالإمكان تجزئة التاريخ:

source: Couldn't find module for url: {0}
ar: لم يتم إيجاد الوحدة باستخدام الرابط الإلكتروني: {0}

source: Extended Due Date
ar: التاريخ المقرر بعد التمديد

source: Users with due date extensions for {0}
ar: المستخدمون الذين لديهم تمديد للتاريخ المقرر لـ {0}

source: Unit
ar: وحدة

source: Due date extensions for {0} {1} ({2})
ar: تمديدالتاريخ المقرر لـ {0} {1} ({2})

source: rescored
ar: تم إعادة تقييم الدرجات

source: reset
ar: تمت إعادة الضبط إلى الوضع الابتدائي

source: deleted
ar: محذوف

source: emailed
ar: تم الإرسال إلى البريد الإلكتروني

source: graded
ar: تم التقييم ووضع الدرجات

source: No status information available
ar: لا توجد معلومات متوفرة عن الحالة

source: No task_output information found for instructor_task {0}
ar: لم يتم إيجاد معلومات مخرجات المَهَمة الخاصة بمَهَمة موجّه المساق {0}

source: No parsable task_output information found for instructor_task {0}: {1}
ar: لم يتم إيجاد معلومات قابلة للتجزئة عن مخرجات مَهَمة موجّه المساق {0}: {1}

source: No parsable status information available
ar: لا تتوفر معلومات قابلة للتجزئة عن حالة مَهَمة موجّه المساق

source: No message provided
ar: لم يتم تقديم أية رسالة

source: Invalid task_output information found for instructor_task {0}: {1}
ar: المعلومات التي تم إيجادها عن مخرجات مَهَمة موجّه المساق {0}: {1} غير صحيحة

source: No progress status information available
ar: لا تتوفر معلومات عن التقدم المحرز

source: No parsable task_input information found for instructor_task {0}: {1}
ar: لم يتم إيجاد معلومات قابلة للتجزئة عن مدخلات مَهَمة موجّه المساق {0}: {1}

source: Progress: {action} {succeeded} of {attempted} so far
ar: التقدّم المحرز: تم {succeeded} في إجراء عملية {action} لـ {attempted} حتى الآن

source: Unable to find submission to be {action} for student '{student}'
ar: ليس بالإمكان إيجاد الورقة المقدّمة من الطالب ’{student}‘ لإجراء عملية {action}

source: Problem failed to be {action} for student '{student}'
ar: لم ينجح إجراء عملية {action} للمشكلة الخاصة بالطالب ’{student}‘

source: Problem successfully {action} for student '{student}'
ar: تم إجراء عملية {action} بنجاح للمشكلة الخاصة بالطالب ’{student}‘

source: Unable to find any students with submissions to be {action}
ar: ليس بالإمكان إيجاد أي طلاب لديهم أوراق مقدّمة بغرض إجراء عملية {action}

source: Problem failed to be {action} for any of {attempted} students
ar: لم ينجح إجراء عملية {action} للمشكلة الخاصة بأيٍ من الطلاب الـ {attempted}
