Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/django-partial.po
Languages: ar

source: Problem successfully {action} for {attempted} students
ar: تم إجراء عملية {action} بنجاح للمشكلة الخاصة بـ {attempted} طالب

source: Problem {action} for {succeeded} of {attempted} students
ar: تم إجراء عملية {action} بنجاح للمشكلة الخاصة بـ {succeeded} من أصل {attempted} طالب

source: Unable to find any recipients to be {action}
ar: لا يمكن إيجاد أي مستلمين لإجراء عملية {action}

source: Message failed to be {action} for any of {attempted} recipients
ar: لم تنجح عملية {action} الرسالة لأيٍ من المستلمين وعددهم {attempted}

source: Message successfully {action} for {attempted} recipients
ar: تمت عملية {action} الرسالة بنجاح لـ {attempted} من المستلمين

source: Message {action} for {succeeded} of {attempted} recipients
ar: تم إجراء عملية {action} بنجاح للرسالة الخاصة بـ {succeeded} من أصل {attempted} مستلم

source: Status: {action} {succeeded} of {attempted}
ar: الحالة: تم {action} لـ {succeeded} من {attempted}

source: (skipping {skipped})
ar: (تخطّي {skipped})

source: (out of {total})
ar: (من أصل {total})

source: Dear %(student_name)s,
ar: العزيز(ة) %(student_name)s،

source: Congratulations on earning your certificate in %(course_name)s! Since you have an account on LinkedIn, you can display your hard earned credential for your colleagues to see. Click the button below to add the certificate to your profile.
ar: نهنئك على نيلك شهادة إتمام مساق(ات) %(course_name)s! ونظراً لامتلاكك حساباً على موقع لينكد إن، فإن بإمكانك إضافة هذا الإنجاز الجديد لقائمة منجزاتك ليتمكن أصدقاؤك من رؤيته. اضغط على الزر الظاهر في الأسفل لإضافة هذه الشهادة إلى ملفك الشخصي.

source: Add to profile
ar: الإضافة إلى الملف الشخصي

source: Could not contact the external grading server. Please contact the development team at {email}.
ar: ليس بالإمكان الاتصال بالمخدم الخارجي الخاص بالتقييم. الرجاء الاتصال بفريق التطوير على البريد الإلكتروني {email}.

source: Cannot find any open response problems in this course. Have you submitted answers to any open response assessment questions? If not, please do so and return to this page.
ar: لا يمكن العثور على مشاكل إستجابة مفتوحة في هذه المساق. هل قمت بالإجابة على أي أسئلة تقييم إستجابة مفتوحة ؟ إن لم تقم بذلك ، الرجاء القيام بها الأن ثم عد إلى هذه الصفحة مرة أخرى .

source: AI Assessment
ar: التقيم بتقنية الذكاء الإصطناعي

source: Peer Assessment
ar: تقييم النظراء

source: Not yet available
ar: غير متاح بعد

source: Automatic Checker
ar: تفقّد آلي

source: Instructor Assessment
ar: تقييم الموجّه

source: Error occurred while contacting the grading service. Please notify course staff.
ar: حدث خطأ أثناء الاتصال بخدمة التقييم. الرجاء إعلام طاقم المساق.

source: Error occurred while contacting the grading service. Please notify your edX point of contact.
ar: حدث خطأ أثناء الاتصال بخدمة التقييم. الرجاء إعلام جهة الاتصال الخاصة بك في edX.

source: for course {0} and student {1}.
ar: للمساق {0} والطالب {1}.

source: View all problems that require peer assessment in this particular course.
ar: استعرض جميع المسائل التي تتطلب تقييم النظراء في هذا المساق تحديداً.

source: View ungraded submissions submitted by students for the open ended problems in the course.
ar: عرض أوراق التقديم التي لم يتم تقييمها، والتي قدّمها الطلاب للمسائل ذات النهايات المفتوحة في المساق.

source: View open ended problems that you have previously submitted for grading.
ar: عرض المسائل ذات النهايات المفتوحة التي قمت بتقديمها مسبقاً ليتم تقييمها.

source: View submissions that have been flagged by students as inappropriate.
ar: عرض أوراق التقديم التي تم وضع علامات عليها من قبل الطلاب على أنها محتوى غير مناسب.

source: New submissions to grade
ar: أوراق مقدّمة جديدة للتقييم

source: New grades have been returned
ar: تمت إعادة الدرجات الجديدة

source: Submissions have been flagged for review
ar: تم وضع علامة على أوراق التقديم لمراجعتها

source: Error with initializing peer grading. There has not been a peer grading module created in the courseware that would allow you to grade others. Please check back later for this.
ar: حدث خطأ في بدء عملية تقييم النظراء. لم يتم إنشاء وحدة لتقييم النظراء في محتويات المساق من شأنها أن تتيح لك تقييم الآخرين. الرجاء العودة للتأكد من إتاحة ذلك لاحقاً.

source: Order Payment Confirmation
ar: تأكيد الدفع لطلب الشراء

source: Trying to add a different currency into the cart
ar: محاولة إضافة عملة مختلفة لسلة التسوق

source: Registration for Course: {course_name}
ar: التسجيل للمساق: {course_name}

source: Please visit your <a href="{dashboard_link}">dashboard</a> to see your new enrollments.
ar: الرجاء زيارة <a href="{dashboard_link}">لوحة المعلومات</a> الخاصة بك للاطلاع على المساقات التي تم تسجيلك بها مؤخراً.

source: [Refund] User-Requested Refund
ar: [Refund] مبلغ الاسترداد الذي طلبه المستخدم

source: Mode {mode} does not exist for {course_id}
ar: الوضع {mode} غير موجود بالنسبة للمساق {course_id}

source: Certificate of Achievement, {mode_name} for course {course}
ar: شهادة الإنجازات، {mode_name} للمساق {course}

source: Note - you have up to 2 weeks into the course to unenroll from the Verified Certificate option and receive a full refund. To receive your refund, contact {billing_email}. Please include your order number in your e-mail. Please do NOT include your credit card information.
ar: ملاحظة - أمامك مهلة لا تزيد عن 2 أسبوع منذ بدء المساق للانسحاب من خيار الشهادة الموثّقة واسترداد المبلغ بالكامل. ولاستلام المبلغ المسترد، الرجاء الاتصال عبر رسالة بريد الإلكتروني على العنوان {billing_email}، والتي يجب أن تتضمن رقم الطلب. الرجاء عدم ذكر معلومات بطاقتك الائتمانية في تلك الرسالة.

source: Order Number
ar: رقم الطلب

source: Customer Name
ar: اسم العميل

source: Date of Original Transaction
ar: تاريخ المعاملة الأصلية

source: Date of Refund
ar: تاريخ استرداد المبلغ

source: Amount of Refund
ar: المبلغ المسترد

source: Service Fees (if any)
ar: رسوم الخدمة (إن وجدت)

source: Purchase Time
ar: وقت الشراء

source: Order ID
ar: الرقم المرجعي للطلب

source: Status
ar: الحالة

source: Quantity
ar: الكمية

source: Unit Cost
ar: تكلفة الوحدة

source: Total Cost
ar: التكلفة الإجمالية

source: Currency
ar: العملة

source: Description
ar: الوصف

source: Comments
ar: التعليقات

source: University
ar: الجامعة

source: Course
ar: المساق

source: Course Announce Date
ar: تاريخ الإعلان عن المساق

source: Course Start Date
ar: تاريخ بدء المساق

source: Course Registration Close Date
ar: تاريخ انتهاء التسجيل بالمساق

source: Course Registration Period
ar: مدة التسجيل في المساق

source: Total Enrolled
ar: إجمالي عدد الطلاب المسجلين

source: Audit Enrollment
ar: تسجيل الحضور والاستماع

source: Honor Code Enrollment
ar: التسجيل في ميثاق الشرف

source: Verified Enrollment
ar: التسجيل الذي تم التحقق منه

source: Gross Revenue
ar: الإيراد الإجمالي

source: Gross Revenue over the Minimum
ar: الإيراد الإجمالي الذي يتجاوز الحد الأدنى

source: Number of Verified Students Contributing More than the Minimum
ar: عدد الطلاب الذين تم التحقق منهم الذين تتجاوز مساهماتهم الحد الأدنى

source: Number of Refunds
ar: عدد مرات استرداد الدفعات

source: Dollars Refunded
ar: إجمالي المبالغ التي تم استردادها بالدولار

source: Number of Transactions
ar: عدد المعاملات

source: Total Payments Collected
ar: مجموع الدفعات التي تم تحصيلها

source: Number of Successful Refunds
ar: عدد مرات الاسترداد التي تمت بنجاح

source: Total Amount of Refunds
ar: إجمالي المبالغ المستردة

source: You must be logged-in to add to a shopping cart
ar: لا بد من تسجيل الدخول حتى يتسنى لك الإضافة إلى سلة التسوق

source: The course you requested does not exist.
ar: المساق الذي طلبته غير موجود.

source: The course {0} is already in your cart.
ar: المساق {0} موجود بالفعل في سلة التسوّق الخاصة بك.

source: You are already registered in course {0}.
ar: لقد قمت بالفعل بالتسجيل في المساق {0}.

source: Course added to cart.
ar: تم إضافة المساق لسلة التسوق.

source: You do not have permission to view this page.
ar: ليست لديك الصلاحيات اللازمة للاطلاع على مكونات هذه الصفحة.

source: The payment processor did not return a required parameter: {0}
ar: لم يقم نظام معالجة الدفع بإرجاع المُدخل المطلوب: {0}

source: The payment processor returned a badly-typed value {0} for param {1}.
ar: قام نظام معالجة الدفع بإرجاع قيمة مطبوعة بشكلٍ سيئ {0} للمُدخل المطلوب {1}.

source: The payment processor accepted an order whose number is not in our system.
ar: قام نظام معالجة الدفع بقبول طلب لا وجود لرقمه في نظامنا.

source: The amount charged by the processor {0} {1} is different than the total cost of the order {2} {3}.
ar: المبلغ المستحق الذي أظهره معالج الدفع {0} {1} يختلف عن المجموع الكلي لكلفة الطلب {2} {3}.

source: <p class="error_msg"> Sorry! Our payment processor did not accept your payment. The decision they returned was <span class="decision">{decision}</span>, and the reason was <span class="reason">{reason_code}:{reason_msg}</span>. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}. </p>
ar: <p class="error_msg"> نأسف! الدفعة المقدّمة لم يتم قبولها من معالج الدفع لدينا. القرار الذي جاء في الرد كان <span class="decision">{decision}</span>, وذلك بسبب <span class="reason">{reason_code}:{reason_msg}</span>. لم يتم اقتطاع المبلغ لديك. الرجاء محاولة الدفع باستخدام طريقة أخرى. الرجاء الاتصال بنا بخصوص أية أسئلة متعلّقة بالدفع على البريد الإلكتروني {email}. </p>

source: <p class="error_msg"> Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data! We apologize that we cannot verify whether the charge went through and take further action on your order. The specific error message is: <span class="exception_msg">{msg}</span>. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}. </p>
ar: <p class="error_msg"> نأسف! أرسل لنا معالج الدفع لدينا رسالة تأكيد على استلام الدفعة تحمل بياناتٍ متناقضة. نعتذر عن عدم إمكان التحقق من أن عملية الدفع قد استكملت بنجاح وبالتالي اتخاذ مزيد من الإجراءات بخصوص طلبك. جاء في رسالة الخطأ تحديداً ما يلي: <span class="exception_msg">{msg}</span>. هناك احتمال أن يكون قد تم اقتطاع المبلغ من بطاقتك الائتمانية. الرجاء الاتصال بنا بخصوص أية أسئلة متعلّقة بالدفع على البريد الإلكتروني {email}. </p>

source: <p class="error_msg"> Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: <span class="exception_msg">{msg}</span>. Your credit card has probably been charged. Contact us with payment-specific questions at {email}. </p>
ar: <p class="error_msg"> نأسف! نظراً لحدوث خطأ فقد تم اقتطاع مبلغ للدفع يختلف عن مبلغ الإجمالي المتوجب بحسب الطلب! جاء في رسالة الخطأ تحديداً ما يلي: <span class="exception_msg">{msg}</span>. هناك احتمال أن يكون قد تم اقتطاع المبلغ من بطاقتك الائتمانية. الرجاء الاتصال بنا بخصوص أية أسئلة متعلّقة بالدفع على البريد الإلكتروني {email}. </p>

source: <p class="error_msg"> Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: <span class="exception_msg">{msg}</span>. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}. </p>
ar: <p class="error_msg"> نأسف! فقد أرسل معالج الدفع لدينا رسالة مشوّهة بخصوص عملية الدفع الخاصة بك، لذا فليس بإمكاننا التحقق ما إذا كانت الرسالة قد جاءت بالفعل من معالج الدفع. جاء في رسالة الخطأ تحديداً ما يلي: <span class="exception_msg">{msg}</span>. نعتذر عن عدم إمكانية التحقق ما إذا تم بالفعل إتمام الدفعة وبالتالي اتخاذ المزيد من الإجراءات بخصوص طلبك. هناك احتمال أن يكون قد تم اقتطاع المبلغ من بطاقتك الائتمانية. الرجاء الاتصال بنا بخصوص أية أسئلة متعلّقة بالدفع على البريد الإلكتروني {email}. </p>

source: Successful transaction.
ar: معاملة ناجحة.

source: The request is missing one or more required fields.
ar: الطلب ينقصه واحد أو أكثر من الحقول المطلوبة.

source: One or more fields in the request contains invalid data.
ar: يحتوي واحد أو أكثر من الحقول في الطلب على بيانات غير صالحة.

source: The merchantReferenceCode sent with this authorization request matches the merchantReferenceCode of another authorization request that you sent in the last 15 minutes. Possible fix: retry the payment after 15 minutes.
ar: إن الرمز المرجعي لدى البائع merchantReferenceCode والذي تم إرساله مع طلب التفويض هذا يطابق الرمز المرجعي لدى البائع merchantReferenceCode لطلب تفويض آخر كنت قد قمت بإرساله في الـ15 دقيقة الأخيرة. الإجراء التصحيحي الممكن: إعادة محاولة الدفع بعد 15 دقيقة.

source: Error: General system failure. Possible fix: retry the payment after a few minutes.
ar: خطأ: خلل عام في النظام، الحل المحتمل: الرجاء إعادة محاولة الدفع بعد دقائق قليلة.

source: Error: The request was received but there was a server timeout. This error does not include timeouts between the client and the server. Possible fix: retry the payment after some time.
ar: خطأ: تم استلام الطلب لكن انتهت المهلة المسموحة على الكمبيوتر المخدّم. هذا الخطأ لا يتضمّن المهل المسموحة ما بين العميل والمخدّم. الإجراء التصحيحي الممكن: إعادة محاولة الدفع بعد مضي بعض الوقت.

source: Error: The request was received, but a service did not finish running in time Possible fix: retry the payment after some time.
ar: خطأ: تم استلام الطلب، لكن إحدى الخدمات لم تُستكمل ضمن الوقت المفروض. الإجراء التصحيحي الممكن: إعادة محاولة الدفع بعد مضي بعض الوقت.

source: The issuing bank has questions about the request. Possible fix: retry with another form of payment
ar: لدى البنك المصدر تساؤلات حول الطلب. الحل المحتمل: الرجاء إعادة المحاولة باستخدام شكلٍ آخر من أشكال الدفع

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible fix: retry with another form of payment
ar: بطاقة الائتمان منتهية الصلاحية. قد يحدث هذا كذلك في حال كان تاريخ انتهاء الصلاحية الذي قدّمته غير مطابق لتاريخ انتهاء الصلاحية المخزن في ملفات البنك المصدر للبطاقة. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: General decline of the card. No other information provided by the issuing bank. Possible fix: retry with another form of payment
ar: رفض للبطاقة الائتمانية بشكل عام. لم يتم تقديم معلومات أخرى من قبل البنك المصدر للبطاقة. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: Insufficient funds in the account. Possible fix: retry with another form of payment
ar: الأرصدة الحالية في الحساب غير كافية لاستكمال العملية. الحل المحتمل: الرجاء إعادة المحاولة بطريقة دفع أخرى

source: Unknown reason
ar: سبب غير معروف.

source: Issuing bank unavailable. Possible fix: retry again after a few minutes
ar: البنك المصدر غير موجود. حل محتمل: الرجاء إعادة المحاولة بعد دقائق قليلة

source: Inactive card or card not authorized for card-not-present transactions. Possible fix: retry with another form of payment
ar: بطاقة ائتمانية غير مفعّلة، أو أن البطاقة غير مصرّح لها للتعاملات التي لا تستلزم وجود البطاقة. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: The card has reached the credit limit. Possible fix: retry with another form of payment
ar: لقد بلغت البطاقة السقف الائتماني المسموح به. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: Invalid card verification number. Possible fix: retry with another form of payment
ar: رقم التحقق الخاص بالبطاقة غير صحيح. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: Invalid account number. Possible fix: retry with another form of payment
ar: رقم الحساب غير صحيح. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: The card type is not accepted by the payment processor. Possible fix: retry with another form of payment
ar: نوعية البطاقة الائتمانية غير مقبولة بالنسبة لمعالج الدفع. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: General decline by the processor. Possible fix: retry with another form of payment
ar: رفض عام من قبل المعالج. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: There is a problem with our CyberSource merchant configuration. Please let us know at {0}
ar: ثمة مشكلة في الإعدادات الخاصة بـ CyberSource merchant. الرجاء إعلامنا في {0}

source: The requested amount exceeds the originally authorized amount.
ar: المبلغ المطلوب يتجاوز المبلغ الأصلي المسموح به.

source: Processor Failure. Possible fix: retry the payment
ar: خلل في معالج البيانات. حل محتمل: إعادة محاولة الدفع مرة أخرى

source: The authorization has already been captured
ar: تمت بالفعل عملية التقاط التفويض

source: The requested transaction amount must match the previous transaction amount.
ar: يجب أن يتطابق مبلغ المعاملة المطلوب مع مبلغ المعاملة السابق.

source: The card type sent is invalid or does not correlate with the credit card number. Possible fix: retry with the same card or another form of payment
ar: نوع البطاقة الائتمانية المرسل غير صحيح أو أنه لا يتماشى مع رقم البطاقة الائتمانية. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام نفس البطاقة أو باستخدام وسيلة أخرى للدفع.

source: The request ID is invalid.
ar: رقم تعريف الطلب غير صحيح.

source: You requested a capture through the API, but there is no corresponding, unused authorization record.
ar: لقد طلبت إجراء عملية التقاط من خلال واجهة برمجة التطبيقات، إلا أنه لا يوجد بالمقابل سجل تفويض غير مستخدم متطابق مع ذلك.

source: The transaction has already been settled or reversed.
ar: لقد تمت تسوية المعاملة أو تم عكسها.

source: The capture or credit is not voidable because the capture or credit information has already been submitted to your processor. Or, you requested a void for a type of transaction that cannot be voided.
ar: إن عملية اقتطاع المبلغ أو عملية الالتقاط غير قابلة للإلغاء حيث تم بالفعل إرسال المعلومات الخاصة بعملية الاقتطاع أو الالتقاط إلى الكمبيوتر المخدّم لدينا. أو أنك قمت بطلب إلغاء لمعاملة من النوع الذي لا يمكن إلغاؤه.

source: You requested a credit for a capture that was previously voided
ar: لقد طلبت مبلغاً ائتمانياً للحصول على عنصر رغم أنه قد تم إلغاؤه مسبقاً

source: Error: The request was received, but there was a timeout at the payment processor. Possible fix: retry the payment.
ar: خطأ: تم استلام الطلب لكن انتهت المهلة المسموحة على معالج الدفع. الإجراء التصحيحي الممكن: إعادة محاولة الدفع.

source: The authorization request was approved by the issuing bank but declined by CyberSource.' Possible fix: retry with a different form of payment.
ar: تمت الموافقة على طلب التفويض من قبل البنك المصدر لكنه رُفِض من CyberSource. الإجراء التصحيحي الممكن: إعادة المحاولة باستخدام وسيلة أخرى للدفع.

source: Download CSV Reports
ar: تنزيل التقارير بصيغة CSV

source: There was an error in your date input. It should be formatted as YYYY-MM-DD
ar: يوجد خطأ في عملية إدخال التاريخ التي قمت بها. يجب أن يتم إدخاله على الشكل YYYY-MM-DD

source: No photo ID was provided.
ar: لم يتم تقديم هوية إثبات شخصية مع صورة.

source: We couldn't read your name from your photo ID image.
ar: لم نتمكن من قراءة اسمك من صورة هوية إثبات الشخصية التي قدّمتها.

source: The name associated with your account and the name on your ID do not match.
ar: لا يتطابق الاسم المرتبط بحسابك مع الاسم المسجل على هويتك الشخصية.

source: The image of your face was not clear.
ar: الصورة المأخوذة عن وجهك كانت غير واضحة بدرجة كافية.

source: Your face was not visible in your self-photo
ar: لم يكن وجهك ظاهراً في صورتك الشخصية

source: There was an error verifying your ID photos.
ar: حدث خطأ أثناء التحقق من صور هويتك الشخصية.

source: Selected price is not valid number.
ar: رقم السعر الذي تم اختياره غير صحيح.

source: This course doesn't support verified certificates
ar: لا يدعم هذا المساق الشهادات الموثّقة

source: No selected price or selected price is below minimum.
ar: لم يتم اختيار سعر أو أن السعر الذي تم اختياره قليل جداً.

source: Skip to this view's content
ar: تخطى حتى تصل إلى المحتوى الخاص بالمعروض هنا

source: Your Password Reset is Complete
ar: تم استكمال عملية إعادة ضبط كلمة السر

source: Your password has been set. You may go ahead and %(link_start)slog in%(link_end)s now.
ar: لقد تم إنشاء كلمة المرور الخاصة بك. بإمكانك الآن %(link_start)s تسجيل الدخول %(link_end)s .

source: Reset Your %(platform_name)s Password
ar: قم بإعادة ضبط كلمة السر الخاصة في %(platform_name)s

source: Reset Your %(platform_name)s Password
ar: قم بإعادة ضبط كلمة السر الخاصة في %(platform_name)s

source: Password Reset Form
ar: نموذج إعادة ضبط كلمة السر

source: We're sorry, %(platform_name)s enrollment is not available in your region
ar: نأسف، التسجيل في %(platform_name)s غير متاح في منطقتك

source: The following errors occurred while processing your registration:
ar: حدثت الأخطاء التالية أثناء إجراء العمليات المتعلقة بتسجيلك:

source: You must complete all fields.
ar: عليك تعبئة جميع الحقول.

source: The two password fields didn't match.
ar: لم تتطابق حقول كلمة السر.

source: We're sorry, our systems seem to be having trouble processing your password reset
ar: نأسف، يظهر أنه ثمة مشكلة قد حدثت في أنظمتنا أثناء معالجة طلب إعادة ضبط كلمة السر الخاصة بك.

source: Someone has been made aware of this issue. Please try again shortly. Please %(start_link)scontact us%(end_link)s about any concerns you have.
ar: لقد تم إعلام الشخص المسؤول بهذه المشكلة. الرجاء إعادة المحاولة بعد قليل. الرجاء %(start_link)sالاتصال بنا%(end_link)s بخصوص أية نقاط مثيرة للقلق.

source: Please enter your new password twice so we can verify you typed it in correctly. <br /> Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
ar: الرجاء إدخال كلمة السر الجديدة مرتين للتأكد من أنك قمت بطباعتها على النحو الصحيح. <br />تم الإشارة إلى الحقول المطلوبة من خلال استخدام <strong class="indicator">الحروف الغامقة وإشارة النجمة (*)</strong>.

source: Required Information
ar: معلومات مطلوبة

source: Your New Password
ar: كلمة السر الجديدة

source: Your New Password Again
ar: كلمة السر الجديدة مرة أخرى

source: Change My Password
ar: تغيير كلمة السر الخاصة بي

source: Your Password Reset Was Unsuccessful
ar: عملية تغيير كلمة السر لم تتم بنجاح

source: The password reset link was invalid, possibly because the link has already been used. Please return to the %(start_link)slogin page%(end_link)s and start the password reset process again.
ar: الرابط لتغيير كلمة السر لم يكن صحيحاً، ربما بسبب استعمال هذا الرابط مسبقاً. الرجاء العودة إلى %(start_link)sصفحة تسجيل الدخول%(end_link)s والبدء بعملية إعادة ضبط كلمة السر مرةً أخرى.

source: Password Reset Help
ar: المساعدة الخاصة بإعادة ضبط كلمة السر

source: Need Help?
ar: تحتاج إلى مساعدة؟

source: View our %(start_link)shelp section for contact information and answers to commonly asked questions%(end_link)s
ar: قم بالاطلاع على %(start_link)sقسم المساعدة للحصول على معلومات الاتصال والإجابات على الأسئلة الشائعة%(end_link)s

source: You're receiving this e-mail because you requested a password reset for your user account at edx.org.
ar: وصلتك رسالة البريد الالكتروني هذه بناءً على طلبك تغيير كلمة السر لحسابك في edx.org

source: Please go to the following page and choose a new password:
ar: الرجاء الذهاب للصفحة التالية واختيار كلمة سر جديدة:

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
ar: في حال لم تطلب هذا التغيير، بإمكانك تجاهل هذه الرسالة الإلكترونية - حيث أننا لم نقم بعد بإعادة ضبط كلمة المرور الخاصة بك.

source: Thanks for using our site!
ar: شكراً لاستخدامك موقعنا!

source: The edX Team
ar: فريق عمل edX

source: Last modified:
ar: تاريخ التعديل الأخير:

source: See all children
ar: الاطلاع على كافة المقالات الفرعية

source: This article was last modified:
ar: تاريخ التعديل الأخير لهذا المقال:

source: Add new article
ar: إضافة مقال جديد

source: Create article
ar: إنشاء مقال

source: Go back
ar: الرجوع

source: Delete article
ar: حذف المقال

source: Delete
ar: حذف

source: You cannot delete a root article.
ar: لا يمكنك حذف مقال رئيسي
