Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/django-partial.po
Languages: ar

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
ar: لا يمكن حذف هذا المقال بسبب عدم إمتلاك صلاحية حذف المقالات التي تحتوي على مقالاتٍ فرعية. الرجاء محاولة حذف المقالات الفرعية واحدة تلو الأخرى.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
ar: جاري حذف مقال، وهذا يعني أن المقالات الفرعية لهذا المقال سيتم حذفها أيضاً. وفي حال اختيار إلغاء مقال، فإنّ المقالات الفرعية له ستلغى أيضاً!.

source: Articles that will be deleted
ar: المقالات التي سيتم حذفها

source: ...and more!
ar: ... وأكثر من ذلك!

source: You are deleting an article. Please confirm.
ar: أنت تقوم بحذف مقال، الرجاء التأكيد.

source: Edit
ar: تعديل

source: Save changes
ar: حفظ التغييرات

source: Preview
ar: معاينة

source: Close
ar: إغلاق

source: Wiki Preview
ar: معاينة الويكي

source: window open
ar: النافذة مفتوحة

source: Back to editor
ar: الرجوع إلى محرر النصوص

source: History
ar: التاريخ

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
ar: أنقر على كل تنقيح لرؤية قائمة الأسطر المعدّلة. وانقر زر المعاينة لرؤية كيفية ظهور المقال في هذه المرحلة. يمكنك في أسفل هذه الصفحة التغيير للرجوع إلى تنقيح معين أو دمج تنقيح قديم مع النسخة الحالية.

source: (no log message)
ar: (لا توجد رسالة للسجل)

source: Preview this revision
ar: معاينة هذا التنقيح

source: Auto log:
ar: حفظ السجل آلياً:

source: Change
ar: تغيير

source: Merge selected with current...
ar: دمج اختيارك مع الحالي...

source: Switch to selected version
ar: التحوّل للنسخة المختارة

source: Wiki Revision Preview
ar: معاينة مراجعات ويكي

source: Back to history view
ar: العودة إلى العرض التاريخي

source: Switch to this version
ar: التحول لهذه النسخة

source: Merge Revision
ar: مراجعة عملية الدمج

source: Merge with current
ar: الدمج مع الحالي

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
ar: عند دمجك لتنقيح معين مع الحالي، سيتم حفظ جميع البيانات من كلا النسختين ودمجها في الموقع التقريبي لها من كل تنقيح.

source: After this, it's important to do a manual review.
ar: بعد القيام بهذا، من المهم القيام بمراجعة يدوية.

source: Create new merged version
ar: إنشاء إصدار مدمج جديد

source: Previewing revision:
ar: معاينة المراجعة:

source: Previewing a merge between two revisions:
ar: معاينة الدمج ما بين مراجعتين:

source: This revision has been deleted.
ar: لقد تم حذف هذه النسخة المنقحة

source: Restoring to this revision will mark the article as deleted.
ar: العودة لهذه النسخة المنقحة سيظهر المقال على أنه مقال محذوف

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
ar: يتعين عليك <a href="%(login_url)s">تسجيل الدخول</a> أو <a href="%(signup_url)s">الاشتراك في الموقع</a> ليتسنى لك استخدام هذه الوظيفة.

source: You need to log in or sign up to use this function.
ar: يتعين عليك تسجيل الدخول أو الاشتراك في الموقع ليتسنى لك استخدام هذه الوظيفة.

source: Wiki Cheatsheet
ar: ورقة الغش الخاصة بـ ويكي

source: Wiki Syntax Help
ar: المساعدة الخاصة بالقواعد اللغوية للـ ويكي

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
ar: تستخدم هذه الويكي <strong>علامات الاستدلال والتنسيق</strong> للتحكم بشكل النص. هناك العديد من الأدلة الإرشادية حول ذلك على الإنترنت. قم بزيارة أي من الروابط أسفل من أجل الحصول على تفاصيل أوسع:

source: Markdown: Basics
ar: علامات الاستدلال والتنسيق: المعلومات الأساسية

source: Quick Markdown Syntax Guide
ar: دليل سريع لقواعد كتابة علامات الاستدلال والترقيم

source: Miniature Markdown Guide
ar: دليل مصغّر لعلامات الاستدلال والترقيم

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
ar: لإنشاء مقال ويكي جديد، يجب إنشاء رابطٍ له، حيث يعطيك النقر على الرابط صفحة إنشاء المقال.

source: edX Additions:
ar: إضافات edX:

source: Math Expression
ar: تعبير رياضي

source: Useful examples:
ar: أمثلة مفيدة:

source: Wikipedia
ar: ويكيبيديا

source: edX Wiki
ar: ويكي edX

source: Huge Header
ar: عنوان صفحة كبير

source: Smaller Header
ar: عنوان صفحة أصغر

source: Unordered List
ar: لائحة غير واردة بالترتيب

source: Sub Item 1
ar: العنصر الفرعي 1

source: Sub Item 2
ar: العنصر الفرعي 2

source: Ordered
ar: مرتبة

source: List
ar: لائحة

source: Quotes
ar: اقتباسات

source: Markdown syntax is allowed. See the %(start_link)scheatsheet%(end_link)s for help.
ar: يسمح بالكتابة باستخدام قواعد ماركداون، ويمكن الاطلاع على %(start_link)s ورقة الغش %(end_link)s لمزيد من المساعدة.

source: Attachments
ar: المرفقات

source: Upload new file
ar: تحميل ملف جديد

source: Search and add file
ar: البحث وإضافة ملف

source: Upload File
ar: تحميل ملف

source: Upload file
ar: تحميل ملف

source: Search files and articles
ar: البحث في الملفات والمقالات

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
ar: بإمكانك إعادة استعمال ملفات من المقالات الأخرى. هذه الملفات عرضة للتحديث في مقالات أخرى مما قد يكون شيئاً مفيداً أو غير جيد بالنسبة لك.

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
ar: الملفات التالية متاحة لهذا المقال. قم بنسخ علامة الاستدلال لتدل مباشرةً على ملف معين من ضمن نص المقال.

source: Markdown tag
ar: علامة الاستدلال

source: Uploaded by
ar: تم تحميله من قبل

source: Size
ar: الحجم

source: File History
ar: تاريخ الملف

source: Detach
ar: فصل

source: Replace
ar: استبدال

source: Restore
ar: استعادة

source: anonymous (IP logged)
ar: مجهول (IP logged)

source: File history
ar: تاريخ الملف

source: revisions
ar: نسخ منقحة

source: There are no attachments for this article.
ar: لا يوجد مرفقات لهذه المقالة.
