Repository: TrellixVulnTeam/edraak_M3JF
Catalog: conf/locale/*/LC_MESSAGES/wiki.po
Languages: ar

source: created
ar: تم الأنشاء

source: Only localhost... muahahaha
ar: المستضيف المحلّي فقط... muahahaha

source: Title
ar: العنوان

source: Initial title of the article. May be overridden with revision titles.
ar: العنوان الإبتدائي للمقالة.من الممكن أنه قد تم إستبداله مع عنوان المراجعة.

source: Type in some contents
ar: اكتب جزء من المحتويات

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
ar: هذا جزء إبتدائي من محتوى مقالتك. بعد إنشاءه، يمكنك إستخدام المزيد من المزايا الأكثر تعقيدا كإستخدام البرامج المساعده،البيانات الوصفية،مقالات متعلقة الخ ،،،

source: Contents
ar: محتويات

source: Summary
ar: تلخيص

source: Give a short reason for your edit, which will be stated in the revision log.
ar: أعطي هدف بسيط للتحرير الخاص بك، والتي سيتم ذكر في سجل المراجعة.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
ar: أثناء التحرير، تغير التنقيح من خلال شخص آخر. تم دمج المحتويات الخاصة بك تلقائياً مع محتويات جديدة. الرجاء مراجعة النص الموجود أدناه

source: No changes made. Nothing to save.
ar: لم يتم الحفظ لعدم وجود أي تعديلات

source: Select an option
ar: حدد أختيارك

source: Slug
ar: سبيكة

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
ar: سيكون هنا العنوان بحيث يمكن العثور على مقالتك، إستخدم أحرف أبجديه رقميه فقط و - أو _. لاحظ لايمكنك تغيير السبيكه بعد إنشاء المقاله.

source: Write a brief message for the article's history log.
ar: أكتب رساله مختصرة لسجل تاريخ المقال.

source: A slug may not begin with an underscore.
ar: قد لا يبدأ العنوان المختصر للرابط بتسطير سفلي

source: A deleted article with slug "%s" already exists.
ar: الصفحة المحذوفة التي تحتوي على العنوان المختصر "%s" موجودة مسبقاً.

source: A slug named "%s" already exists.
ar: العنوان المختصر المسمّى "%s" موجود مسبقاً.

source: Yes, I am sure
ar: نعم, أنا متأكد

source: Purge
ar: إلغاء

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
ar: إلغاء المقال: يحذف بالكامل (بالإضافة إلى كلّ محتوياته) من دون إمكانية التراجع عن ذلك. يُعْتَبَر الإلغاء فكرةً جيّدةً إذا كنت ترغب في إفراغ العنوان المختصر بحيث يمكن للمستخدمين إنشاء مقالات جديدة لتحلّ محلّه.

source: You are not sure enough!
ar: أنت لست متأكد بما فيه الكفاية!

source: While you tried to delete this article, it was modified. TAKE CARE!
ar: أحترس, أنت تحاول حذف مقال تم تعديله.

source: Lock article
ar: تعليق المقال

source: Deny all users access to edit this article.
ar: حذر جميع المستخدمين من تعديل هذا المقال

source: Permissions
ar: الصلاحيات

source: Owner
ar: المالك

source: Enter the username of the owner.
ar: أدخل أسم المالك

source: (none)
ar: (لا شيء)

source: Inherit permissions
ar: توريث الصلاحيات

source: Check here to apply the above permissions recursively to articles under this one.
ar: قم بوضع علامة على هذا الخيار من أجل تطبيق الصلاحيات أعلاه بشكل متكرر على المقالات التابعة لهذا المقال.

source: Permission settings for the article were updated.
ar: تم تحديث الصلاحيات لهذا المقال

source: Your permission settings were unchanged, so nothing saved.
ar: لم يتم حقظ أي تعديلات على الصلاحيات

source: No user with that username
ar: لا يوجد مستخدم بهذا الأسم

source: Article locked for editing
ar: التعديل مغلق لهذا المقال

source: Article unlocked for editing
ar: هذا المقال يمكن تعديله

source: Filter...
ar: تقليل عدد النتائج...

source: Settings for plugin
ar: إعدادات البرامج المساعدة

source: current revision
ar: مراجعة حالية

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
ar: يجري عرض المراجعة لهذا المقال. إذا كنت ترغب في العودة إلى المحتوى السابق، يكفي أن تقوم بتغيير قيمة هذا الحقل.

source: modified
ar: تمّ التعديل

source: Article properties last modified
ar: آخر تعديل لخصائص المقال

source: owner
ar: مالك

source: The owner of the article, usually the creator. The owner always has both read and write access.
ar: صاحب المقالة هو غالبا المبتكر و لديه الاذن للقراءة و الكتابة.

source: group
ar: مجموعة

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
ar: كما هو الحال في نظام ملف UNIX، يمكن إعطاء الصلاحيات لمستخدمٍ ما وفقاً لعضوية المجموعة. يتمّ التعامل مع المجموعات من خلال نظام المصادقة Django.

source: group read access
ar: إتاحة القراءة من قبل المجموعة

source: group write access
ar: إتاحة تعديل المحتوى من قبل المجموعة

source: others read access
ar: إتاحة القراءة من قبل الآخرين

source: others write access
ar: إتاحة التعديل من قبل الآخرين

source: Article without content (%(id)d)
ar: مقال من دون محتوى (%(id)d)

source: content type
ar: نوع المحتوى

source: object ID
ar: الرقم التعريفي للكائن

source: Article for object
ar: مقال للكائن

source: Articles for object
ar: المقالات للكائن

source: revision number
ar: رقم المراجعة

source: IP address
ar: عنوان إنترنت

source: user
ar: مستخدم

source: deleted
ar: محذوف

source: locked
ar: مقفل

source: article
ar: مقالة

source: article contents
ar: محتويات المقالة

source: article title
ar: عنوان المقالة

source: Each revision contains a title field that must be filled out, even if the title has not changed
ar: تشمل كلّ مراجعة حقل العنوان الذي يجب تعبئته، حتّى لو لم يتمّ تغيير العنوان.

source: original article
ar: مقال أصلى

source: Permissions are inherited from this article
ar: يتمّ توريث التصريحات من هذا المقال

source: A plugin was changed
ar: تمّ تغيير أحد البرامج المساعدة

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
ar: يجري عرض المراجعة لهذا البرنامج المساعد. إذا كنت ترغب في العودة إلى المحتوى السابق، يكفي أن تقوم بتغيير قيمة هذا الحقل.

source: Cache lookup value for articles
ar: قيمة البحث عن النسخة للمقالات

source: slug
ar: عنوان مختصر

source: (root)
ar: (الجذر)

source: URL path
ar: مسار الرابط الإلكتروني

source: URL paths
ar: مسارات الرابط الإلكتروني

source: Sorry but you cannot have a root article with a slug.
ar: عذراً، ولكن لا يمكنك حذف مقال رئيسي ذات عنوان مختصر.

source: A non-root note must always have a slug.
ar: يجب أن تتضمّن الملاحظة غير الجذرية عنواناً مختصراً دائماً

source: There is already a root node on %s
ar: ثمّة بالفعل عقدة جذرية في %s

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
ar: المقالات التي تم تعد مرتبطة بمقالاتها الأساسية ================================ تم إلغاء المقالات الرئيسية التي تتبع لها المقالات التابعة. يفضّل أن تقوم بإيجاد مقالٍ رئيسي خاصٍ بها.

source: Lost and found
ar: ضاع و عثر عليه

source: Description
ar: الوصف

source: A short summary of what the file contains
ar: ملخص صغير لمحتويات الملف

source: Yes I am sure...
ar: نعم أنا متأكد

source: Click to download file
ar: أضغط لتحميل الملف

source: The revision of this attachment currently in use (on all articles using the attachment)
ar: يجري حالياً مراجعة هذا المرفق (ينطبق ذلك على كلّ المقالات التي تستخدم هذا المرفق)

source: original filename
ar: إسم الملفّ الأصلي

source: attachment
ar: مرفق

source: attachments
ar: مرفقات

source: file
ar: ملف

source: attachment revision
ar: مراجعة المرفق

source: attachment revisions
ar: عمليات مراجعة المرفق

source: %s was successfully added.
ar: تمّ إضافة %s بنجاح.

source: Your file could not be saved: %s
ar: لا يمكن حفظ ملفّك: %s

source: Your file could not be saved, probably because of a permission error on the web server.
ar: لا يمكن حفظ ملفّك، ربما بسبب خطأ في التصريح على مخدّم الويب.

source: %s uploaded and replaces old attachment.
ar: تمّ تحميل %s واستبدال المرفق القديم به.

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
ar: ستتمّ إعادة تسمية ملفّك الجديد تلقائياً ليطابك إسم الملف الذي كان موجوداً مسبقاً. لا يسمح بالملفات ذات الامتدادات المختلفة.

source: Current revision changed for %s.
ar: تغيّرت المراجعة الحالية لـ %s.

source: Added a reference to "%(att)s" from "%(art)s".
ar: إضافة مرجع إلى "%(att)s" من "%(art)s".

source: The file %s was deleted.
ar: تمّ حذف الملف %s.

source: This article is no longer related to the file %s.
ar: لم يعد هذا المقال مرتبطاً بالملف %s.

source: Attachments
ar: المرفقات

source: A file was changed: %s
ar: تمّ تغيير أحد الملفات: %s

source: A file was deleted: %s
ar: تمّ حذف أحد الملفّات: %s

source: Help
ar: المساعدة

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
ar: تمّت عملية تحميل الصورة الجديدة %s بنجاح. يمكنك استخدامها عن طريق اختيارها من القائمة الخاصّة بالصور المتاحة.

source: Are you sure?
ar: هل أنت متأكّد؟

source: image
ar: صورة

source: images
ar: الصور

source: Image: %s
ar: الصورة: %s

source: Current revision not set!!
ar: لم يتمّ ضبط المراجعة الحالية!!

source: image revision
ar: مراجعة الصورة

source: image revisions
ar: عمليات مراجعة الصورة

source: Image Revsion: %d
ar: مراجعة الصورة: %d

source: %s has been restored
ar: تمّت استعادة %s

source: %s has been marked as deleted
ar: تمّت الإشارة إلى %s بإنّه محذوف

source: %(file)s has been changed to revision #%(revision)d
ar: تمّ تغيير %(file)s إلى مراجعة #%(revision)d

source: %(file)s has been saved.
ar: تمّ حفظ %(file)s

source: Images
ar: الصور

source: An image was added: %s
ar: تمّ إضافة صورة: %s

source: Links
ar: روابط إلكترونية

source: Notifications
ar: إشعارات

source: When this article is edited
ar: عندما تمّ تعديل هذا المقال

source: Also receive emails about article edits
ar: استلام رسائل إلكترونية بخصوص التعديلات التي يتمّ إجراؤها على المقال

source: Your notification settings were updated.
ar: تمّ تحديث إعدادات الإشعارات الخاصة بك.

source: Your notification settings were unchanged, so nothing saved.
ar: لم يتمّ تغيير إعدادات الأشعارات الخاصة بك، وبالتالي لم يتم حفظ أي جديد

source: %(user)s subscribing to %(article)s (%(type)s)
ar: تسجيل %(user)s في %(article)s (%(type)s)

source: Article deleted: %s
ar: تم حذف المقال: %s

source: Article modified: %s
ar: تم تعديل المقال: %s

source: New article created: %s
ar: تمّ إنشاء مقال جديد: %s

source: You are now sign up... and now you can sign in!
ar: تمت عملية تسجيلك... وأصبح بإمكانك الآن تسجيل الدخول!

source: You are no longer logged in. Bye bye!
ar: أنت لم تعد مسجل للدخول. الى اللقاء!

source: You are now logged in! Have fun!
ar: لقد قمت بتسجيل الدخول! استمتع!

source: New article '%s' created.
ar: تمّ إنشاء مقال جديد '%s'.

source: There was an error creating this article: %s
ar: حدث خطأ أثناء إنشاء هذا المقال: %s

source: There was an error creating this article.
ar: وجد خطأ اثناء انشاء هذه المقالة

source: This article cannot be deleted because it has children or is a root article.
ar: لا يمكن حذف هذا المقال لأنّه يتضمّن مقالات فرعية أو لأنّه مقال جذري.

source: This article together with all its contents are now completely gone! Thanks!
ar: تم التخلّص بشكلٍ تام من هذا المقال ومن كافة محتوياته! شكراً لكم!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
ar: تم وضع إشارة على المقال "%s" تفيد بأنه محذوف! نشكركم على إبقاء الموقع خالياً من المواد غير المرغوب فيها!

source: Your changes were saved.
ar: لقد تم حفظ تغييراتك

source: A new revision of the article was succesfully added.
ar: تمت بنجاح اضافة مراجعة جديدة للمقال

source: Restoring article
ar: استعادة المقال

source: The article "%s" and its children are now restored.
ar: تمت الآن إستعادة المقال "%s" وكافة مقالاته الفرعية.

source: The article %s is now set to display revision #%d
ar: تم إعداد المقال %s الآن بحيث يعرض النسخة #%d

source: New title
ar: عنوان جديد

source: Merge between Revision #%(r1)d and Revision #%(r2)d
ar: الدمج ما بين النسخة #%(r1)d والنسخة #%(r2)d

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
ar: تم إنشاء نسخة جديدة: بالإمكان الدمج ما بين النسخة #%(r1)d والنسخة #%(r2)d
